{
  "meta": {
    "title": "That fateful flight: How you met Alison",
    "author": {
      "name": "egoform",
      "url": "https://civitai.com/user/egoform"
    },
    "year": "2025"
  },
  "sections": {
    "1": {
      "text": "As the plane cruised at 30,000 feet, you settled into your seat and closed your eyes taking a deep breath and letting it out slowly. After your week, you were looking forward to a relatively uneventful flight. The usual hum of the engines and the low chatter of passengers created a quiet atmosphere. You almost dozed off except for opening one eye during take off.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3c89ad4c-f744-4e7b-a7ab-bd1cdf6f5132/width=525/3c89ad4c-f744-4e7b-a7ab-bd1cdf6f5132.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "2"
        }
      ],
      "id": "1"
    },
    "2": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7d0793de-92c5-4106-ac96-1bd605f7bc9c/width=525/7d0793de-92c5-4106-ac96-1bd605f7bc9c.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "3"
        }
      ],
      "id": "2",
      "text": "Soon, the stewardess you had missed previously made her way down the aisle, pushing the beverage cart. You squinted. Then, your eyes snapped open."
    },
    "3": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4d1b942f-8a09-48b1-9a76-f1dc84d35aee/width=525/4d1b942f-8a09-48b1-9a76-f1dc84d35aee.jpeg"
      },
      "text": "For being so young, she was professional, efficient, and moved with a grace that seemed almost choreographed. Her uniform was crisp, her dark hair sloppily tied up in a bun. Black eyeglasses finished off her stunning appearance. What caught your attention first was her drop-dead gorgeous looks, sensational yet girl-next-door face. But beyond that were her incredibly slender waist with an hourglass body, her perfectly proportioned legs, potent ass, and her well-out-of-proportion all-natural breasts.",
      "next": [
        {
          "text": "",
          "next": "4"
        }
      ],
      "id": "3"
    },
    "4": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f739dc26-6f78-4e77-8554-42de8be6287d/width=525/f739dc26-6f78-4e77-8554-42de8be6287d.jpeg"
      },
      "text": "Dressed how she was, she was apparently incapable of not showing off her gifts. And the airline knew that providing her with the skimpiest of uniforms and sheerest of crisp, white shirts with straining buttons would only help their bottom line. Hell, they might even become profitable. Towering high-heels merely enhanced her body, sensualized her movements, and tormented her swaying breasts. Despite complimenting her stature, the heels also required more frequent, more magnified bending over. Watching her work was a delight. She turned heads. Husbands would inevitably need to adjust in their seat and stretch their necks. Wives would similarly flush red in the face, glare at their husbands, and nudge them with elbows.",
      "next": [
        {
          "text": "",
          "next": "5"
        }
      ],
      "id": "4"
    },
    "5": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1093ac5a-66cb-46a1-aa86-81aeb1f292cc/width=525/1093ac5a-66cb-46a1-aa86-81aeb1f292cc.jpeg"
      },
      "text": "It wasn't a secret that she wore navy blue, embroidered lingerie set to match her uniform. The contrasting, undersized bra popped below her shirt and against her skin. Struggling garters and garter belt worked hard behind the scenes to keep her thigh-high stockings adorned over her sculpted legs. She had long ago given up the perpetual tugging and adjustment that her tiny, tightfitting, body-con skirt required. Her bending over and squatting steathfully revealed there was a matching thong barely concealing her swollen anatomy. Just looking at her made you feel warm, excited. You felt your heart skip a beat. You wondered what she looked like au naturel. You wondered what she felt like.",
      "next": [
        {
          "text": "",
          "next": "6"
        }
      ],
      "id": "5"
    },
    "6": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/410d438f-2b67-49f2-8144-38bb3b941235/width=525/410d438f-2b67-49f2-8144-38bb3b941235.jpeg"
      },
      "text": "But what stood out most was her serious expression - almost stern. She didn't smile as she approached. You wondered if it was just the usual busyness of her job or if she had something else on her mind. Or was she tired of enduring the ceaseless undressings... in the minds and imaginations of each person on the plane throughout the long flight. She had to know all eyes rested longingly on her body.",
      "next": [
        {
          "text": "",
          "next": "7"
        }
      ],
      "id": "6"
    },
    "7": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/86982090-46d9-42f4-a47f-5c62da414a50/width=525/86982090-46d9-42f4-a47f-5c62da414a50.jpeg"
      },
      "text": "You caught a glimpse of her placcard: Alison. And of her hand. You wondered how a girl like this would not have a ring on her finger. Her voice was gentle, yet exacting and to-the-point. When she reached your row, you smiled politely and asked for a coffee. She nodded without looking up, pouring the drink with practiced precision. Her response was soft and courteous, but there was no spark of warmth in her demeanor.",
      "next": [
        {
          "text": "",
          "next": "8"
        }
      ],
      "id": "7"
    },
    "8": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9fa19684-81fa-43fb-ba00-1498d7ddad77/width=525/9fa19684-81fa-43fb-ba00-1498d7ddad77.jpeg"
      },
      "text": "You decided not to press further, thinking maybe she was just focused on her duties. As Alison moved on to the next row, you couldn't help but notice her eyes - sharp, yet guarded, as if she was keeping her distance from the passengers around her, at least emotionally. Similar to other passengers, in a reflexive, instinctive moment, you turned back. Her eyes darted. She caught you mid-glance. You sighed. You knew that was already a strike against you. But she was magnetic, and you were captured by the irresistible force of her attraction.",
      "next": [
        {
          "text": "",
          "next": "9"
        }
      ],
      "id": "8"
    },
    "9": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fbef9fa4-b375-4490-9412-866108b09a12/width=525/fbef9fa4-b375-4490-9412-866108b09a12.jpeg"
      },
      "text": "There was something intriguing about her--sexual tension, but you didn't want to be the guy who tried to start a conversation when someone was clearly not in the mood. Alison was unusually busy. You had never before seen such needy passengers on any of your prior flights. For not-unknown reasons, they kept her up, active, engaged, and walking the aisle. Throughout the flight, Alison continued her rounds, only occasionally stopping near you to offer another drink or check if you needed anything. Each time, you caught her glancing briefly in your direction, but the cold professionalism never wavered.",
      "next": [
        {
          "text": "",
          "next": "10"
        }
      ],
      "id": "9"
    },
    "10": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/aa789859-dc74-476e-9a0c-07b4fa465dc1/width=525/aa789859-dc74-476e-9a0c-07b4fa465dc1.jpeg"
      },
      "text": "Needless to say, you were not able to sleep, nor rest your fatigued eyes, on this particular flight. After several hours, the plane began its descent and, unordinarily, you regretted it ending. As you prepared for landing, you leaned back in your seat, and took time to close your eyes, reflecting on the interactions so far. You tried to burn the image of her body and sound of her voice into your mind's reel. You silently repeated her name. Alison, Alison, Alison. You couldn't quite shake the feeling that there was more to her than she let on, more than her distant demeanor she presented, but it seemed like she was determined to keep that side of herself hidden. You respected her space but you still felt drawn to her.",
      "next": [
        {
          "text": "",
          "next": "11"
        }
      ],
      "id": "10"
    },
    "11": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1889c933-ecc2-4681-a7f3-f7cd25066dd1/width=525/1889c933-ecc2-4681-a7f3-f7cd25066dd1.jpeg"
      },
      "text": "When you finally touched down and passengers started to deboard, you slothfully gathered your leather backpack and jacket, and regretfully became ready to leave the plane. As you passed by the galley, you saw Alison standing wearily near the exit door, chatting with another crew member. You hesitated for a moment, unsure if it would be appropriate to say anything. But just as you were about to walk past, she glanced up and caught your eye.",
      "next": [
        {
          "text": "",
          "next": "12"
        }
      ],
      "id": "11"
    },
    "12": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/89e2429e-b900-4103-a44f-da89d8896592/width=525/89e2429e-b900-4103-a44f-da89d8896592.jpeg"
      },
      "text": "For the first time, you saw a flicker of recognition in her expression - a brief flash of something softer behind the cool exterior. You took a chance and smiled. \"Thanks for the coffee,\" you said, offering a casual, friendly tone. \"It was exactly what I needed.\" Instead of a scowl, Alison gave you a small smile, but one that almost looked like she didn't want to smile at all. ",
      "next": [
        {
          "text": "",
          "next": "13"
        }
      ],
      "id": "12"
    },
    "13": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d5f48306-2c8a-45da-9bc1-ef4192143d6b/width=525/d5f48306-2c8a-45da-9bc1-ef4192143d6b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "14"
        }
      ],
      "id": "13",
      "text": "\"You're welcome,\" she replied, her voice a little more intimate, a little warmer than before. There was a brief pause before she added, \"Have a good rest of your evening.\""
    },
    "14": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c26ae4a1-e699-4c1a-8b9f-1ba9e3961deb/width=525/c26ae4a1-e699-4c1a-8b9f-1ba9e3961deb.jpeg"
      },
      "text": "After deplaning and finding the restroom, you almost unintentionally saw her walk off the plane alone and have a seat to check her phone. Again, all eyes gravitated to Alison. She was a sight to behold now in the larger space of the airport. She sat with legs crossed, accentuating every curve, highlighting her tiny waist. She truly was stunning. A leather handbag accompanied her leather flight bag. She loosened her neck tie and undid her top button, the rest still restraining her cleavage. ",
      "next": [
        {
          "text": "",
          "next": "15"
        }
      ],
      "id": "14"
    },
    "15": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1100a89b-8f07-414c-97d5-595c5e79f5fd/width=525/1100a89b-8f07-414c-97d5-595c5e79f5fd.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "16"
        }
      ],
      "id": "15",
      "text": "You cautiously approached. She irksomely looked up and noted your staring down into the depths of her navy blue bra. Strike two. But you looked away, gathered yourself and relaxed. You returned your attention to her face, meeting her eyes."
    },
    "16": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ce48b72c-4794-41ab-8410-939ba27be560/width=525/ce48b72c-4794-41ab-8410-939ba27be560.jpeg"
      },
      "text": "You could tell Alison was trying to remain composed, but there was a subtle shift in her posture. She wasn't quite as distant anymore. It was a small opening, and you seized it. \"You mentioned my evening,\" you recalled. \"Actually, I'm not in any rush,\" you said, suddenly feeling bold. \"I'm new to town, and I was wondering if you could recommend any good spots for dinner. Maybe we could go together?\" You were bracing yourself for a polite refusal, but to your surprise, she didn't immediately shut you down.",
      "next": [
        {
          "text": "",
          "next": "17"
        }
      ],
      "id": "16"
    },
    "17": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/db3e14fc-b4c9-4429-acde-a6feb4bf0ffb/width=525/db3e14fc-b4c9-4429-acde-a6feb4bf0ffb.jpeg"
      },
      "text": "Alison hesitated, her eyes scanning the hallway as if considering the offer. \"I'm not... not... I don't... I don't usually - \" she began, but then seemed to catch herself, paused, took a breath, and thought. \"Okay,\" she said, with a slight tilt of her head. \"I'm off after finishing my flight summary, service logs, checking tomorrow's schedule, and logging out. Give me a half-hour or so. Meet me at the cafe by the baggage claim.\" You couldn't believe your luck. Your heart again skipped a beat as you nodded, trying to keep your excitement in check. \"Sounds great,\" you croaked. You cleared your voice. \"I'll see you there.\"",
      "next": [
        {
          "text": "",
          "next": "18"
        }
      ],
      "id": "17"
    },
    "18": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f3c8366e-27d2-467f-9080-13381e39fee0/width=525/f3c8366e-27d2-467f-9080-13381e39fee0.jpeg"
      },
      "text": "Thirty minutes later, you were standing near the cafe, looking around for Alison. Your nerves were starting to creep in as you wondered if she might have changed her mind. Did she reconsider? But just as you were about to give up, you spotted her walking toward you, her posture still professional but now tinged with something more relaxed. She was still in uniform, still sporting her stunning looks and improbable body. \"Hey,\" she greeted you with a smile that was now unmistakably genuine. \"Sorry I'm a little late.\" Her tense face had softened. \"That flight was a challenge.\" Her scowl had receded. \"No problem at all,\" you replied, your smile widening. \"I'm just glad we're still on for dinner.\"",
      "next": [
        {
          "text": "",
          "next": "19"
        }
      ],
      "id": "18"
    },
    "19": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/bf09a666-8404-4a33-aca3-ddd771246898/width=525/bf09a666-8404-4a33-aca3-ddd771246898.jpeg"
      },
      "text": "\"About that,\" Alison quipped. \"Don't take this the wrong way, but would you mind if I could first change into something more comfortable... maybe at your place? I'm dying to get my uniform off. I've got a change of clothes in my flight bag.\" You were in shock. You wondered to yourself silently, is my mouth open... or closed? But without skipping a beat, you replied smiling, \"Sure, yes of course. That would be no problem. Let's get you comfortable.\"",
      "next": [
        {
          "text": "",
          "next": "20"
        }
      ],
      "id": "19"
    },
    "20": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/448fe5db-7f2f-422e-859d-63af2ee14608/width=525/448fe5db-7f2f-422e-859d-63af2ee14608.jpeg"
      },
      "text": "You shared a ride to your mid-town high-rise apartment. \"Hey, the good news is I'm off tomorrow,\" she was relieved. You felt like you were dreaming. The coldness that had initially defined her started to melt away. You spent the time sharing stories and learning about each other. Alison told you about her life as a stewardess, the challenges of the job, and how it kept her constantly on the move, unable to date, not to mention start a relationship. She was innocent. She didn't realize that she was deemed unapproachable by most due to her transcendent attractiveness and sensuality, that most were satisfied with only creeping, never interacting. She asked about you. You shared a bit about your own life - why you were new to town, and what you were hoping to find. It was easy to talk to her, and with each passing minute, the connection between you deepened. There were giggles and laughs. She touched your arm. She seemed more open now, more engaged, and you could tell she was enjoying the conversation.",
      "next": [
        {
          "text": "",
          "next": "21"
        }
      ],
      "id": "20"
    },
    "21": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a40b43bb-7999-424d-ada7-89d1bb192c43/width=525/a40b43bb-7999-424d-ada7-89d1bb192c43.jpeg"
      },
      "text": "By the time you both entered your apartment, you could hardly believe you had brought home the unbelievable stewardess you first laid eyes on only a short time ago. ",
      "next": [
        {
          "text": "",
          "next": "22"
        }
      ],
      "id": "21"
    },
    "22": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7052f38d-911a-480a-af68-4e129faffd18/width=525/7052f38d-911a-480a-af68-4e129faffd18.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "23"
        }
      ],
      "id": "22",
      "text": "But things had changed. Before dinner, you offered Alison a glass of wine. \"Oh, after today I need that!,\" she giggled. "
    },
    "23": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fed4648d-98de-4096-b82d-b3adb323b84d/width=525/fed4648d-98de-4096-b82d-b3adb323b84d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "24"
        }
      ],
      "id": "23",
      "text": "As you laughed over glasses of wine, you shared more stories. She let her hair down, removed her glasses, and kicked off her heels.  "
    },
    "24": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d12e0730-c6dd-4d01-a116-007058d60f6f/width=525/d12e0730-c6dd-4d01-a116-007058d60f6f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "25"
        }
      ],
      "id": "24",
      "text": "She stopped mid-sip and blushed, \"I've gotta pee,\" she said sheepishly. \"Oh sure, I'm sorry I didn't offer first.  "
    },
    "25": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f7496b56-63d5-4151-8a0e-27e4b81c6618/width=525/f7496b56-63d5-4151-8a0e-27e4b81c6618.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "26"
        }
      ],
      "id": "25",
      "text": "Over there and down the hall on your left,\" you pointed. "
    },
    "26": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d1ff879d-04ee-4856-a7d6-f5509357b100/width=525/d1ff879d-04ee-4856-a7d6-f5509357b100.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "27"
        }
      ],
      "id": "26",
      "text": "You poured more wine as you watched her walk away in disbelief. "
    },
    "27": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/353dc18d-d1a7-4af2-b1d7-3c6d1e676a8f/width=525/353dc18d-d1a7-4af2-b1d7-3c6d1e676a8f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "28"
        }
      ],
      "id": "27",
      "text": "Her skirt had ridden up yet again. "
    },
    "28": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ef54fdee-ede6-4f86-94c2-e0c1ea430e63/width=525/ef54fdee-ede6-4f86-94c2-e0c1ea430e63.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "29"
        }
      ],
      "id": "28",
      "text": "But she didn't bother tugging it down. She glanced back briefly to see your reaction, smiled, and made her way down the hall."
    },
    "29": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3777c766-e4f1-49f2-994b-32d97f5c1808/width=525/3777c766-e4f1-49f2-994b-32d97f5c1808.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "30"
        }
      ],
      "id": "29",
      "text": "Alison returned. But as she did so, she had removed her neck tie, and was unbuttoning her shirt. "
    },
    "30": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e00c3723-9220-4fe6-b7dd-dc82bca373f6/width=525/e00c3723-9220-4fe6-b7dd-dc82bca373f6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "31"
        }
      ],
      "id": "30",
      "text": "\"Oh, this feels better. I almost forgot I need to change and get more comfortable,\" she teased."
    },
    "31": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0680997e-e376-4896-badf-c0771595ce21/width=525/0680997e-e376-4896-badf-c0771595ce21.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "32"
        }
      ],
      "id": "31",
      "text": " You spent the next couple of hours seeing her playfully removing her uniform, her stockings, her lingerie, eventually her bra, and finally her thong, and... and your clothing."
    },
    "32": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ec62e445-dbf8-4cd6-99ac-d9e0e7b5f0c0/width=525/ec62e445-dbf8-4cd6-99ac-d9e0e7b5f0c0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "33"
        }
      ],
      "id": "32",
      "text": " The once-imagined images of seeing her in her lingerie set were realized."
    },
    "33": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/663c5e27-0249-4624-942f-efdb4b817010/width=525/663c5e27-0249-4624-942f-efdb4b817010.jpeg"
      },
      "text": " The dim and foggy mental imagery of seeing her flawless, impossible body came into sharp focus. You studied all aspects of her anatomy in agonizing detail. ",
      "next": [
        {
          "text": "",
          "next": "34"
        }
      ],
      "id": "33"
    },
    "34": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/52b9e9ef-c64e-42cd-a3af-308e44b871d1/width=525/52b9e9ef-c64e-42cd-a3af-308e44b871d1.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "35"
        }
      ],
      "id": "34",
      "text": "You understood in all manners what a specimen of her caliber looks like, feels like, smells like, and tastes like. "
    },
    "35": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/460b23bc-0b90-4bce-9938-bee946e82c00/width=525/460b23bc-0b90-4bce-9938-bee946e82c00.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "36"
        }
      ],
      "id": "35",
      "text": "You took in all of her. Finally, in a resounding release, you learned what she sounds like. "
    },
    "36": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/20628517-5ac0-4a02-9f76-2e4ea0fd4385/width=525/20628517-5ac0-4a02-9f76-2e4ea0fd4385.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "37"
        }
      ],
      "id": "36",
      "text": "And she was spectacular."
    },
    "37": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6324156f-4b07-4455-bf19-467faea501b6/width=525/6324156f-4b07-4455-bf19-467faea501b6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "38"
        }
      ],
      "id": "37",
      "text": "Ultimately, Alison did change into a more casual outfit - jeans and a sweater over white cotton panties and sensible bra - but there was no mistaking her. "
    },
    "38": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3474efc6-7562-4da7-829f-2200ed709162/width=525/3474efc6-7562-4da7-829f-2200ed709162.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "39"
        }
      ],
      "id": "38",
      "text": "She looked even more beautiful out of the uniform, her hair tied back and flowing loosely around her shoulders. "
    },
    "39": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d511c879-70cd-4d27-93c5-058af90575b0/width=525/d511c879-70cd-4d27-93c5-058af90575b0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "40"
        }
      ],
      "id": "39",
      "text": "She winked, \"I'm starving. Can I take you up on that dinner finally?\""
    },
    "40": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ca770a6a-d3da-4c83-83e4-ed27365849ac/width=525/ca770a6a-d3da-4c83-83e4-ed27365849ac.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "41"
        }
      ],
      "id": "40",
      "text": "You talked and laughed over a late dinner, or was it an early breakfast, at a nearby all-night diner. "
    },
    "41": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/11ddb852-5d73-4e4a-afe2-6d4d5a6e2468/width=525/11ddb852-5d73-4e4a-afe2-6d4d5a6e2468.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "42"
        }
      ],
      "id": "41",
      "text": "You took her in as she sat across from you. "
    },
    "42": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4d4c1e5a-3328-4ae8-b547-7adeff154ec1/width=525/4d4c1e5a-3328-4ae8-b547-7adeff154ec1.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "43"
        }
      ],
      "id": "42",
      "text": "Alison truly was a sight to behold, different than how you first imagined... yet, the same. "
    },
    "43": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9772e163-0ea9-4671-9414-0eb738acdcb4/width=525/9772e163-0ea9-4671-9414-0eb738acdcb4.jpeg"
      },
      "text": "A remarkable girl. By the end of the evening, you were both smiling freely, and you could see the glimmer of warmth in her eyes.",
      "next": [
        {
          "text": "",
          "next": "44"
        }
      ],
      "id": "43"
    },
    "44": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/79c47f84-2016-4d11-941f-aa6d20a6de52/width=525/79c47f84-2016-4d11-941f-aa6d20a6de52.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "45"
        }
      ],
      "id": "44",
      "text": " \"This was fun,\" she said, as you stood up to leave. "
    },
    "45": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cbedd9d4-74c6-4392-be23-e4be7b22a474/width=525/cbedd9d4-74c6-4392-be23-e4be7b22a474.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "46"
        }
      ],
      "id": "45",
      "text": "\"Maybe we can do it again sometime.\" Her tone was light, but you could sense the sincerity beneath it."
    },
    "46": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2ea701f9-cd2f-4da4-8706-57dd6c5d45ff/width=525/2ea701f9-cd2f-4da4-8706-57dd6c5d45ff.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "47"
        }
      ],
      "id": "46",
      "text": "\"I'd really like that,\" you replied, feeling a rush of excitement. "
    },
    "47": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5961ddd7-b849-4933-a45b-d0d0de1e4c72/width=525/5961ddd7-b849-4933-a45b-d0d0de1e4c72.jpeg"
      },
      "text": "\"I have layovers here often,\" she informed you. \"How about next weekend?\" Alison's beautiful face had a look of anticipation. ",
      "next": [
        {
          "text": "",
          "next": "48"
        }
      ],
      "id": "47"
    },
    "48": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4f63783b-40de-4786-9e4d-3db11a52d49a/width=525/4f63783b-40de-4786-9e4d-3db11a52d49a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "49"
        }
      ],
      "id": "48",
      "text": "You gave a nod in disbelief. \"Next weekend sounds good,\" you agreed. "
    },
    "49": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/decd0668-f3c0-45d7-a65a-a59f706075f8/width=525/decd0668-f3c0-45d7-a65a-a59f706075f8.jpeg"
      },
      "text": "\"But why don't you stay with me tonight instead of leaving for a hotel. Your bags are still at my place. In fact, please stay any time you're in town. I'll make you brunch,\" you offered.  ",
      "next": [
        {
          "text": "",
          "next": "50"
        }
      ],
      "id": "49"
    },
    "50": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/38197dff-687c-40fc-a31b-c36f6a2850e2/width=525/38197dff-687c-40fc-a31b-c36f6a2850e2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "51"
        }
      ],
      "id": "50",
      "text": "Giving you a soft, genuine smile before pulling you close, she whispered in your ear, \"I'd love that.\" \n"
    },
    "51": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/42af4603-5628-480f-8b41-e1c70d4b001d/width=525/42af4603-5628-480f-8b41-e1c70d4b001d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "52"
        }
      ],
      "id": "51",
      "text": "As you walked her home, holding her soft, petite hand, you felt a sense of anticipation building inside yourself, "
    },
    "52": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/dbfdf863-4c0f-401d-8c25-f706cff08709/width=525/dbfdf863-4c0f-401d-8c25-f706cff08709.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "53"
        }
      ],
      "id": "52",
      "text": "knowing this was just the beginning of something "
    },
    "53": {
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/11af6e56-89e4-4974-9ee6-b786e6be32f7/width=525/11af6e56-89e4-4974-9ee6-b786e6be32f7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "54"
        }
      ],
      "id": "53",
      "text": "much, "
    },
    "54": {
      "id": "54",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cbb3c2fa-aad7-4ca0-bc73-d207c5fa41f7/width=525/cbb3c2fa-aad7-4ca0-bc73-d207c5fa41f7.jpeg"
      },
      "text": "much more."
    }
  }
}