{
  "sections": {
    "1": {
      "text_lines": [
        "Annie, albeit somewhat of a tomboy, started as a normal, nice, petite, demoiselle. However, at age she was already self-conscious even before becoming aware of her changing body, pubic hair, budding breasts and sensitive nipples. But until academy, she had always done well to ignore her forthcoming womanly body. She was dropped off at the intensive boarding academy with little but the clothes she was wearing and her backpack full of supplies."
      ],
      "id": "1",
      "media": {
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/73f46107-5af1-48c2-bfc4-6b5ce916e44d/width=525/73f46107-5af1-48c2-bfc4-6b5ce916e44d.jpeg",
        "type": "image"
      },
      "next": [
        {
          "text": "",
          "next": 2
        }
      ]
    },
    "2": {
      "id": "2",
      "text_lines": [
        "On her first day, she was told lessons begin at once. She was immediately instructed to report for a health and hygiene check, and that this was a vital part of her instruction. Washing and bathing are to be performed daily. Annie was usually disheveled and messy, but that sounded reasonable. She was made to take all of her clothes off. She had hated being naked. The check felt so embarrassing. She was notified that she paid too little attention to her hygiene and that she must stop her obviously lustful thoughts. Education requires both a clean body and clean mind. She was told it was apparent that she had neither. A high degree of concern was shown regarding her pubic hair and nipples. It was true. She had never paid them much attention. But now, they were brought to the forefront of her mind because they were highlighted as a problem. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4116b13b-1843-44aa-b773-a81096e63325/width=525/4116b13b-1843-44aa-b773-a81096e63325.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 6
        }
      ]
    },
    "3": {
      "id": "3",
      "text_lines": [
        "Next, Annie was instructed to report for her uniform fitting. The uniform would follow her throughout her time at academy. She should take great care of it. She would be happy to. She looked forward to it. At least she would have a uniform like the others she saw walking the hallways, allowing her to conceal her body and her particular problem areas. She was mortified that the process again required disrobing. A clipboard was intently studied, notes reviewed. Prolonged gazes studied her nakedness, switched to the clipboard and back repeatedly. To her dismay, this took some time, which did not help her avoid the swelling and moistening of her pussy, and arousal and erection of her nipples. She knew she was to avoid this and yet she failed again already. She tried to push the awareness of the coolness she felt on her body out of her mind. But she found that only reinforced her arousal. Measurements were taken in full nakedness and in a variety of positions. Photos were taken. Due to her obvious failures with arousal, she was notified that she would not be issued a bra. One would only press in on her breasts and rub coursely on her nipples, causing them to become erect. Besides she was told, she was not aged, her breasts were still firm and not too large yet. They did not sag, so she really didn't need one. She mentally resigned, knowing she could use any help avoiding arousal of her nipples. While allowed, she was encouraged that panties likewise should be kept to a minimum and as needed. Small panties or thongs would be permitted as a privilege. Any problems with arousal would cause the immediate removal of that privilege. Problems down there will necessitate not wearing any as to avoid her awareness of lace rubbing on her pussy. She needed to be careful. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/aaf20e72-c70b-45b5-b414-bd533ee253b2/width=525/aaf20e72-c70b-45b5-b414-bd533ee253b2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 4
        }
      ]
    },
    "4": {
      "id": "4",
      "text_lines": [
        "Thigh-high stockings must be worn at all times. Had the other girls she'd seen been wearing stockings? She recalled not. They were allowed to wear shorts under their skirts. But maybe they didn't struggle with a dirty mind and body like herself. She lamented and nodded her understanding. To her dismay, she was fitted with a quite tiny uniform. Wearing the skirt, it felt short, and she was quite certain her butt cheeks were hanging out and her pussy barely covered. She felt exposed. It felt drafty between her legs. Why was the skirt so small? Why did her uniform look so much smaller compared to the common style? How would she be able to face the staff, faculty and academicship? She worried the jacket and shirt were too short, small and tight already. It was difficult to button the too-few buttons. She realized her breasts had been growing continuously and feared how badly this uniform would fit should her unspoken fears come to pass. Hopefully, they wouldn't grow much. She could always hope. She now looked in the giant mirror into which she had previously avoided looking. Pleading meekly for a different uniform only resulted in quite stern reprimands. She tried to blink away tears. How she had hoped she could blend in and hide having a uniform! That would not be the case."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5/width=525/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 5
        }
      ]
    },
    "5": {
      "id": "5",
      "text_lines": [
        "As the academic year proceeded, Annie's hair grew, as did her breasts... and as did her arousal. Her nipples were always hard and erect. The slightest movement, let alone walking, caused her now ample breasts to sway. Below the thin fabric of her shirt, they bounced. She felt them. And her nipples responded dutifully. Her struggles only worsened. So much so that it became necessary for any staff and faculty to perform random health checks on Annie. It could happen at any time or place. Male or female, they checked. It needed to be done. At first, they would be somewhat private and discrete. Later, not so much."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5a46821c-f875-442f-813d-ecc509b30e99/original=true,quality=90/c227c59f-5f32-44b7-8262-587ff620fb39_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 7
        }
      ]
    },
    "6": {
      "id": "6",
      "text_lines": [
        "Her pubic hair was trimmed and shaved up above her pussy to expose her now smooth and shiny vulva. It was to be kept shaved as such daily. This would promote cleanliness and health, as well as making periodic health checks easier. As far as her nipples, she must be always aware of her arousal, their state, strive to keep them unerect, and should they become erect, work to avoid focusing on them so as to reduce their sensitivity. They were obviously a sign of an unclean mind. This heightened concern only made Annie even more self-conscious. Now, after the humiliation and obvious failure on her first day, it seemed this was all she could think about."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d1034cb1-0ed4-4847-9366-1369e4e63276/original=true,quality=90/6b0c9674-fa22-4258-b5a6-f234d80a211a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "3"
        }
      ]
    },
    "7": {
      "id": "7",
      "text_lines": [
        "They demanded she expose her breasts. And if not completely erect initially, her exposure and vulnerability then made her nipples snap to aching attention. Never did a check find Annie in compliance. They demanded her to drop her panties. She failed miserably over and over. Fully nude, nothing helped. Panty privilege was lost to required thongs. Thong privilege was lost to required bare skin in order to alleviate those nagging, moist desires between her legs. Nothing helped. Her nipples gave her state away. Her glossy, wet pussy betrayed her obsessions. She was haunted by her exposure. Her exposure fed her arousal. Her arousal fueled feelings inside her body. Every day was a tortured spiral down into even more exposure, more arousal, more desire."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b0796f57-7d63-41f6-a947-37dbca1296ac/width=525/b0796f57-7d63-41f6-a947-37dbca1296ac.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 8
        }
      ]
    },
    "8": {
      "id": "8",
      "text_lines": [
        "The headmistress was informed. She kept constant tabs on Annie. The decision was made to assign her the desk at the front of the lecture hall, set off by herself, alone, so she would not be influenced, nor tempted to hide her conditions amongst the others. She was placed at her desk in full display. All eyes were upon her. She could not hide. She was terribly embarrassed. Is everyone looking at me and my body? They are. I just know they are. My boobs are so full, so tender and so sensitive. My pussy feels like it's so slick and throbbing. I bet everyone sees that. I bet my nipples are super hard. Yep, they are. Everyone is looking at them. Why did she have these struggles? Why was she so filthy? Was she beyond help? It seemed so. These were her unceasing thoughts. Her attention was lost. And her academic marks suffered."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/af3a3d0e-f3da-48ac-bb15-a4c3c071ec38/original=true,quality=90/15485c0d-ab63-4a69-82bb-8228a9487924_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 9
        }
      ]
    },
    "9": {
      "id": "9",
      "text_lines": [
        "The headmistress issued orders to all staff and faculty to focus more on Annie, and to step up health checks. Educators were reminded to keep pressing her. Some demanded that Annie stand at the front of the hall. Some insisted that she remove her jacket in full display of the academicship. Others commanded her to remove her thong as an exhibition. She obliged. She could not think straight. She felt broken. Some days, she felt like she was out of her uniform more than in it."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4108d4a0-0bbd-4779-a17c-db850b7bdd97/original=true,quality=90/f4479bfd-28e2-4de6-ad52-5e4e25029ac9_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 10
        }
      ]
    },
    "10": {
      "id": "10",
      "text_lines": [
        "Every day, and in every session, Annie was called upon by educators. She was required to stand up from her chair in order to attempt to answer the frequent questions. She hadn't even heard the question. All she heard were the thoughts in her head. And the feelings. Those feelings in her body. She must try harder."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/25961813-f283-4bac-9a07-aa957515d23c/original=true,quality=90/c5e95776-306a-43c7-b02f-6609445a0ca3_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 11
        }
      ]
    },
    "11": {
      "id": "11",
      "text_lines": [
        "Annie was made to stand up front, shamefully making feeble attempts at writing work on the huge blackboard. The assignment was always written on the top of the board, and the board moved up high. This caused her to have to reach with arms raised and on her toes. Her skirt lifted to around her waist. At least one breast never failed to bounce out under the lifted shirt. She was not allowed to cover or conceal her shame. She just fought off the anguish. Nevertheless, this made her so humiliated. She felt like she, and her arousal, were on full display. They were."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/07f87935-e16e-42a0-847a-77e940b3cc14/original=true,quality=90/400e7b84-c4ae-4557-9b3a-bd2f01d8839e_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 12
        }
      ]
    },
    "12": {
      "id": "12",
      "text_lines": [
        "Other educators would sit in and try to help Annie. But didn't they know that simply made her even more of the focal point. It didn't feel like they were helping. At times, Annie was made to attend with her shirt raised, or her shirt opened. The concensus was that if Annie was showcased enough, then they may be able to salvage her. Well, maybe not Annie, but maybe others. She was a lost cause."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/bbe7e590-8ff1-4f90-89fe-1bbde51d75d2/original=true,quality=90/bd265fe6-c733-45c8-a6e3-6f72a71cd456_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 13
        }
      ]
    },
    "13": {
      "id": "13",
      "text_lines": [
        "Annie's supposed coequals treated her as inferior. And she was. She knew she was. She couldn't pretend that their pointing, stares, giggles, and whispers went unnoticed. All it took was a little teasing and her pussy would start dripping. It was obvious. She was mortified. Those in the hallways or locker rooms always seemed to not-so-accidentally brush against her breasts, or brush against her ass. Some grabbed, others groped, girls tickled, all in an apparent attempt to cause a swift and thorough health check from their superiors. Health checks became essentially public, and in full display. No matter how hard Annie tried, she failed."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a0b3160e-f46e-4674-99ad-5863052b64ff/original=true,quality=90/1d05c4cb-62fc-40d8-b7f1-ec2483b8229a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 14
        }
      ]
    },
    "14": {
      "id": "14",
      "text_lines": [
        "Annie had just started her first year at academy. She was horny. She could no longer deny it. And the year was only just beginning..."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0a8c246d-ef5b-49fb-8cc6-1b78e3fb58b6/original=true,quality=90/911bed89-79c5-49b3-9aa0-0794dec3c36d_a1111.jpeg"
      }
    }
  }
}