{
  "meta": {
    "title": "Annies Story",
    "author": {
      "name": "egoform",
      "url": "https://civitai.com/user/egoform"
    },
    "year": "2025"
  },
  "state": {
    "current_section": "16"
  },
  "sections": {
    "1": {
      "text_lines": [
        "Annie, albeit somewhat of a tomboy, started as a normal, nice, petite, demoiselle. However, at age she was already self-conscious even before becoming aware of her changing body, pubic hair, budding breasts and sensitive nipples. But until academy, she had always done well to ignore her forthcoming womanly body. She was dropped off at the intensive boarding academy with little but the clothes she was wearing and her backpack full of supplies."
      ],
      "id": "1",
      "media": {
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/73f46107-5af1-48c2-bfc4-6b5ce916e44d/width=525/73f46107-5af1-48c2-bfc4-6b5ce916e44d.jpeg",
        "type": "image"
      },
      "next": [
        {
          "text": "",
          "next": 2
        }
      ]
    },
    "2": {
      "id": "2",
      "text_lines": [
        "On her first day, she was told lessons begin at once. She was immediately instructed to report for a health and hygiene check, and that this was a vital part of her instruction. Washing and bathing are to be performed daily. Annie was usually disheveled and messy, but that sounded reasonable. She was made to take all of her clothes off. She had hated being naked. The check felt so embarrassing. She was notified that she paid too little attention to her hygiene and that she must stop her obviously lustful thoughts. Education requires both a clean body and clean mind. She was told it was apparent that she had neither. A high degree of concern was shown regarding her pubic hair and nipples. It was true. She had never paid them much attention. But now, they were brought to the forefront of her mind because they were highlighted as a problem. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4116b13b-1843-44aa-b773-a81096e63325/width=525/4116b13b-1843-44aa-b773-a81096e63325.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 6
        }
      ]
    },
    "3": {
      "id": "3",
      "text_lines": [
        "Next, Annie was instructed to report for her uniform fitting. The uniform would follow her throughout her time at academy. She should take great care of it. She would be happy to. She looked forward to it. At least she would have a uniform like the others she saw walking the hallways, allowing her to conceal her body and her particular problem areas. She was mortified that the process again required disrobing. A clipboard was intently studied, notes reviewed. Prolonged gazes studied her nakedness, switched to the clipboard and back repeatedly. To her dismay, this took some time, which did not help her avoid the swelling and moistening of her pussy, and arousal and erection of her nipples. She knew she was to avoid this and yet she failed again already. She tried to push the awareness of the coolness she felt on her body out of her mind. But she found that only reinforced her arousal. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/aaf20e72-c70b-45b5-b414-bd533ee253b2/width=525/aaf20e72-c70b-45b5-b414-bd533ee253b2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 17
        }
      ]
    },
    "4": {
      "id": "4",
      "text_lines": [
        "Thigh-high stockings must be worn at all times. Had the other girls she'd seen been wearing stockings? She recalled not. They were allowed to wear shorts under their skirts. But maybe they didn't struggle with a dirty mind and body like herself. She lamented and nodded her understanding. To her dismay, she was fitted with a quite tiny uniform. Wearing the skirt, it felt short, and she was quite certain her butt cheeks were hanging out and her pussy barely covered. She felt exposed. It felt drafty between her legs. Why was the skirt so small? Why did her uniform look so much smaller compared to the common style? How would she be able to face the staff, faculty and academicship? She worried the jacket and shirt were too short, small and tight already. It was difficult to button the too-few buttons. She realized her breasts had been growing continuously and feared how badly this uniform would fit should her unspoken fears come to pass. Hopefully, they wouldn't grow much. She could always hope. She now looked in the giant mirror into which she had previously avoided looking. Pleading meekly for a different uniform only resulted in quite stern reprimands. She tried to blink away tears. How she had hoped she could blend in and hide having a uniform! That would not be the case."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5/width=525/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 5
        }
      ]
    },
    "5": {
      "id": "5",
      "text_lines": [
        "As the academic year proceeded, Annie's hair grew, as did her breasts... and as did her arousal. Her nipples were always hard and erect. The slightest movement, let alone walking, caused her now ample breasts to sway. Below the thin fabric of her shirt, they bounced. She felt them. And her nipples responded dutifully. Her struggles only worsened. So much so that it became necessary for any staff and faculty to perform random health checks on Annie. It could happen at any time or place. Male or female, they checked. It needed to be done. At first, they would be somewhat private and discrete. Later, not so much."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5a46821c-f875-442f-813d-ecc509b30e99/original=true,quality=90/c227c59f-5f32-44b7-8262-587ff620fb39_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 7
        }
      ]
    },
    "6": {
      "id": "6",
      "text_lines": [
        "Her pubic hair was trimmed and shaved up above her pussy to expose her now smooth and shiny vulva. It was to be kept shaved as such daily. This would promote cleanliness and health, as well as making periodic health checks easier. As far as her nipples, she must be always aware of her arousal, their state, strive to keep them unerect, and should they become erect, work to avoid focusing on them so as to reduce their sensitivity. They were obviously a sign of an unclean mind. This heightened concern only made Annie even more self-conscious. Now, after the humiliation and obvious failure on her first day, it seemed this was all she could think about."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d1034cb1-0ed4-4847-9366-1369e4e63276/original=true,quality=90/6b0c9674-fa22-4258-b5a6-f234d80a211a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "3"
        }
      ]
    },
    "7": {
      "id": "7",
      "text_lines": [
        "They demanded she expose her breasts. And if not completely erect initially, her exposure and vulnerability then made her nipples snap to aching attention. Never did a check find Annie in compliance. They demanded her to drop her panties. She failed miserably over and over. Fully nude, nothing helped. Panty privilege was lost to required thongs. Thong privilege was lost to required bare skin in order to alleviate those nagging, moist desires between her legs. Nothing helped. Her nipples gave her state away. Her glossy, wet pussy betrayed her obsessions. She was haunted by her exposure. Her exposure fed her arousal. Her arousal fueled feelings inside her body. Every day was a tortured spiral down into even more exposure, more arousal, more desire."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b0796f57-7d63-41f6-a947-37dbca1296ac/width=525/b0796f57-7d63-41f6-a947-37dbca1296ac.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 8
        }
      ]
    },
    "8": {
      "id": "8",
      "text_lines": [
        "The headmistress was informed. She kept constant tabs on Annie. The decision was made to assign her the desk at the front of the lecture hall, set off by herself, alone, so she would not be influenced, nor tempted to hide her conditions amongst the others. She was placed at her desk in full display. All eyes were upon her. She could not hide. She was terribly embarrassed. Is everyone looking at me and my body? They are. I just know they are. My boobs are so full, so tender and so sensitive. My pussy feels like it's so slick and throbbing. I bet everyone sees that. I bet my nipples are super hard. Yep, they are. Everyone is looking at them. Why did she have these struggles? Why was she so filthy? Was she beyond help? It seemed so. These were her unceasing thoughts. Her attention was lost. And her academic marks suffered."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/af3a3d0e-f3da-48ac-bb15-a4c3c071ec38/original=true,quality=90/15485c0d-ab63-4a69-82bb-8228a9487924_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 9
        }
      ]
    },
    "9": {
      "id": "9",
      "text_lines": [
        "The headmistress issued orders to all staff and faculty to focus more on Annie, and to step up health checks. Educators were reminded to keep pressing her. Some demanded that Annie stand at the front of the hall. Some insisted that she remove her jacket in full display of the academicship. Others commanded her to remove her thong as an exhibition. She obliged. She could not think straight. She felt broken. Some days, she felt like she was out of her uniform more than in it."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4108d4a0-0bbd-4779-a17c-db850b7bdd97/original=true,quality=90/f4479bfd-28e2-4de6-ad52-5e4e25029ac9_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 10
        }
      ]
    },
    "10": {
      "id": "10",
      "text_lines": [
        "Every day, and in every session, Annie was called upon by educators. She was required to stand up from her chair in order to attempt to answer the frequent questions. She hadn't even heard the question. All she heard were the thoughts in her head. And the feelings. Those feelings in her body. She must try harder."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/25961813-f283-4bac-9a07-aa957515d23c/original=true,quality=90/c5e95776-306a-43c7-b02f-6609445a0ca3_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 11
        }
      ]
    },
    "11": {
      "id": "11",
      "text_lines": [
        "Annie was made to stand up front, shamefully making feeble attempts at writing work on the huge blackboard. The assignment was always written on the top of the board, and the board moved up high. This caused her to have to reach with arms raised and on her toes. Her skirt lifted to around her waist. At least one breast never failed to bounce out under the lifted shirt. She was not allowed to cover or conceal her shame. She just fought off the anguish. Nevertheless, this made her so humiliated. She felt like she, and her arousal, were on full display. They were."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/07f87935-e16e-42a0-847a-77e940b3cc14/original=true,quality=90/400e7b84-c4ae-4557-9b3a-bd2f01d8839e_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 12
        }
      ]
    },
    "12": {
      "id": "12",
      "text_lines": [
        "Other educators would sit in and try to help Annie. But didn't they know that simply made her even more of the focal point. It didn't feel like they were helping. At times, Annie was made to attend with her shirt raised, or her shirt opened. The concensus was that if Annie was showcased enough, then they may be able to salvage her. Well, maybe not Annie, but maybe others. She was a lost cause."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/bbe7e590-8ff1-4f90-89fe-1bbde51d75d2/original=true,quality=90/bd265fe6-c733-45c8-a6e3-6f72a71cd456_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 13
        }
      ]
    },
    "13": {
      "id": "13",
      "text_lines": [
        "Annie's supposed coequals treated her as inferior. And she was. She knew she was. She couldn't pretend that their pointing, stares, giggles, and whispers went unnoticed. All it took was a little teasing and her pussy would start dripping. It was obvious. She was mortified. Those in the hallways or locker rooms always seemed to not-so-accidentally brush against her breasts, or brush against her ass. Some grabbed, others groped, girls tickled, all in an apparent attempt to cause a swift and thorough health check from their superiors. Health checks became essentially public, and in full display. No matter how hard Annie tried, she failed."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a0b3160e-f46e-4674-99ad-5863052b64ff/original=true,quality=90/1d05c4cb-62fc-40d8-b7f1-ec2483b8229a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 14
        }
      ]
    },
    "14": {
      "id": "14",
      "text_lines": [
        "Annie had just started her first year at academy. She was horny. She could no longer deny it. And the year was only just beginning..."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0a8c246d-ef5b-49fb-8cc6-1b78e3fb58b6/original=true,quality=90/911bed89-79c5-49b3-9aa0-0794dec3c36d_a1111.jpeg"
      },
      "next": [
        {
          "text": "Chapter 2 - Annie's worsening",
          "next": 15
        },
        {
          "text": "Back to Index",
          "next": "16"
        }
      ]
    },
    "15": {
      "id": "15",
      "text_lines": [
        "# Chapter 2",
        "## Annie's worsening"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9a120e5f-3fba-4e6f-8ecb-6d3c3d82fc85/width=1320/45.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 18
        }
      ]
    },
    "16": {
      "id": "16",
      "text_lines": [
        "# Annie's Story",
        "",
        "**This is an adult graphic novel containing explicit sexual narrative and pictures. If you are under age, please leave.**",
        "",
        "All the credit for the story goes to [egoform](https://civitai.com/user/egoform). The original version is to be found on civitai:",
        "",
        "- [Chapter 1](https://civitai.com/articles/10803/annies-time-at-the-higher-academy)",
        "- [Chapter 2](https://civitai.com/articles/10833/annies-worsening)",
        "- [Chapter 3](https://civitai.com/articles/10867/discipline-for-annie)",
        "- [Chapter 4](https://civitai.com/articles/10892/annies-first-counseling-session)",
        "- [Chapter 5](https://civitai.com/articles/11019/annie-learns-some-restraint)",
        "- [Chapter 6](https://civitai.com/articles/11047/annie-starts-modeling)",
        "",
        "[Some additional pictures](https://civitai.com/collections/7923667) were created for the story and it was brought into this form by [lizzard9](https://civitai.com/user/lizzard9).",
        ""
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4378078a-619b-40e9-b7ec-5bb1fbf4fecd/original=true,quality=90/54634320.jpeg"
      },
      "next": [
        {
          "text": "Chapter 1 - Annie's time at the higher academy",
          "next": "1"
        },
        {
          "text": "Chapter 2 - Annie's worsening",
          "next": "15"
        },
        {
          "text": "Chapter 3 - Discipline for Annie",
          "next": "51"
        },
        {
          "text": "Chapter 4 - Annie's first counseling session",
          "next": 91
        },
        {
          "text": "Chapter 5 - Annie learns some restraint",
          "next": "92"
        },
        {
          "text": "Chapter 6 - Annie starts modeling",
          "next": "93"
        }
      ]
    },
    "17": {
      "id": "17",
      "text_lines": [
        "Measurements were taken in full nakedness and in a variety of positions. Photos were taken. Due to her obvious failures with arousal, she was notified that she would not be issued a bra. One would only press in on her breasts and rub coursely on her nipples, causing them to become erect. Besides she was told, she was not aged, her breasts were still firm and not too large yet. They did not sag, so she really didn't need one. She mentally resigned, knowing she could use any help avoiding arousal of her nipples. While allowed, she was encouraged that panties likewise should be kept to a minimum and as needed. Small panties or thongs would be permitted as a privilege. Any problems with arousal would cause the immediate removal of that privilege. Problems down there will necessitate not wearing any as to avoid her awareness of lace rubbing on her pussy. She needed to be careful. "
      ],
      "next": [
        {
          "text": "",
          "next": "4"
        }
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c6e90fbe-1cb9-4da9-86d5-5d2595ec8e6c/original=true,quality=90/90590e5d-11a7-4af3-af59-26de0fdaf589_a1111.jpeg"
      }
    },
    "18": {
      "id": "18",
      "text_lines": [
        "As the academic year advanced on, so did the efforts to make Annie aware of her condition. Her hair continued to grow, but so also did her breasts... not to mention her burning desires. Annie had an unclean mind and an unclean body. It had been made known to her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/03de3aaa-76b8-4724-a58b-3bec66a7a8d0/width=525/03de3aaa-76b8-4724-a58b-3bec66a7a8d0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 19
        }
      ]
    },
    "19": {
      "id": "19",
      "text_lines": [
        "She needed to be reminded of the disappointment. Her failures needed to be made public. Learning was the objective. And learning demands a clean mind and body"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c076a356-aa1e-4e08-998b-11fa315bbc24/width=525/c076a356-aa1e-4e08-998b-11fa315bbc24.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 20
        }
      ]
    },
    "20": {
      "id": "20",
      "text_lines": [
        "Annie's obsession with her dirty mind and body only intensified. She struggled constantly with her sensitive, erect nipples and her swollen, wet pussy. Beyond that, she struggled with the intense desires and nagging feelings deep inside her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9eca7ea3-f777-4d71-af8b-7bd0190725d2/width=525/9eca7ea3-f777-4d71-af8b-7bd0190725d2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 21
        }
      ]
    },
    "21": {
      "id": "21",
      "text_lines": [
        "It was imperative that Annie be aware of her arousal. Her problems with arousal were always noticed and emphasized, her body always highlighted, always on display. She needed that if she was to regain any control. And this higher academy demanded control. Humiliation was part of the process. If there was any hope for Annie, awareness was necessary. Control was necessary."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e03ab9c8-3883-4b33-b1a1-e4b1eb151b04/width=525/e03ab9c8-3883-4b33-b1a1-e4b1eb151b04.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 22
        }
      ]
    },
    "22": {
      "id": "22",
      "text_lines": [
        "She was made an exhibit. Her failures were on center stage. She was paraded throughout the day, and that was by intention. Day by day, she would be exposed and humiliated. And day by day, she would fail."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3b3b5dd9-5673-4856-9a21-b82d63b19391/width=525/3b3b5dd9-5673-4856-9a21-b82d63b19391.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 23
        }
      ]
    },
    "23": {
      "id": "23",
      "text_lines": [
        "Annie may indeed be lost, but using her as an object lesson was the next best outcome. Then at least others can learn from her inadequacies. Firsthand learning at the expense of Annie's dignity would be worth it. The academy would not let Annie stand in the way of learning, even if she was unable."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/920262f8-717b-4bd9-8a68-7cda1fe31eb0/width=525/920262f8-717b-4bd9-8a68-7cda1fe31eb0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 24
        }
      ]
    },
    "24": {
      "id": "24",
      "text_lines": [
        "The health checks were now more and more frequent, often occurring between every lecture, and occasionally during one--at the front of the auditorium. Meticulous tabs were kept on Annie. Notes were recorded. Photos were taken. Arousal levels were measured. That required more groping and fondling than a typical health check. And by more than one of the staff."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/222835c8-1b76-4f30-ab44-311801c14b42/width=525/222835c8-1b76-4f30-ab44-311801c14b42.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 25
        }
      ]
    },
    "25": {
      "id": "25",
      "text_lines": [
        "Her arousal had become so rampant that it had spread throughout many other parts of her body. The slightest breath near her ear, the slightest tug on her hair, the slightest caress of her skin, the most gentle poking of her rectum. These all set her off. And Annie could not hide it. Oh, how she tried to hide it. It was no use. Concealing her arousal was nonexistent. She felt dejected."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0b3fd4a5-0cef-4155-89e0-5bd7e1810dd4/width=525/0b3fd4a5-0cef-4155-89e0-5bd7e1810dd4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 26
        }
      ]
    },
    "26": {
      "id": "26",
      "text_lines": [
        "None of the other girls needed near the amount of attention the staff and faculty paid Annie. Her mind was in perpetual knots. She couldn't think straight. But it was made apparent that she was different. She knew that. The other girls don't seem to have my same problems. My nipples are constantly aroused. I feel them hard all the time."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3ca6f255-3e6f-4b2a-96f0-6b0cd14fe96e/width=525/3ca6f255-3e6f-4b2a-96f0-6b0cd14fe96e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 27
        }
      ]
    },
    "27": {
      "id": "27",
      "text_lines": [
        "I so want to touch another girl, to see what she feels like. Is her body so different than mine? Stop it! What's wrong with me? I lost my panty privilege because I'm so horny. My thoughts aren't helping. Don't I care that everyone can see my wet pussy? I'm sure they realize what I'm thinking. My body makes it obvious."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/931250a2-3862-4821-a216-f6e35f27447e/width=525/931250a2-3862-4821-a216-f6e35f27447e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 28
        }
      ]
    },
    "28": {
      "id": "28",
      "text_lines": [
        "Annie was ashamed. Annie knew she was hopeless. But she also knew she deserved this. It's my fault. If I could control myself and control my thoughts, I wouldn't need this. I wish I could be like the other girls. I wish I had a clean mind and body."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b84736c5-deca-4ec1-b5ce-4af8431103bf/width=525/b84736c5-deca-4ec1-b5ce-4af8431103bf.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 29
        }
      ]
    },
    "29": {
      "id": "29",
      "text_lines": [
        "She had always been teased, even by the staff and faculty. The academicship pointed and whispered and tickled, as a game, as entertainment, all in an effort to expose her arousal, which in turn required attention from a superior, likely demanding disrobing, being made an object lesson, or a health check... or all of the above. When ever and where ever. They found it funny."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/14ca9d5b-7320-406b-8bb4-61401de82756/width=525/14ca9d5b-7320-406b-8bb4-61401de82756.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 30
        }
      ]
    },
    "30": {
      "id": "30",
      "text_lines": [
        "They knew it revealed how bad Annie is. She can't control how horny she is. Annie heard some of the whispers. Look, look how horny Annie is today. It's even worse than yesterday. I bet she's a slut. Annie heard it all, but she kept quiet."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e2307fff-3801-4bf1-8e28-7c5bcb4e13de/width=525/e2307fff-3801-4bf1-8e28-7c5bcb4e13de.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 31
        }
      ]
    },
    "31": {
      "id": "31",
      "text_lines": [
        "She didn't say anything. She knew it must be true. I am. So she kept to herself. She tried in vain to not focus on her dirty mind and body. She failed. It's not possible for me to have friends. No one wants a friend like me, someone so awful."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/70a7d692-90f2-4d51-8272-f84fb7d8d3c7/width=525/70a7d692-90f2-4d51-8272-f84fb7d8d3c7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 32
        }
      ]
    },
    "32": {
      "id": "32",
      "text_lines": [
        "Annie almost had her big mistake, and that quite by accident. Daily hygiene requirements included her shaving her pussy. It was to be kept smooth. Razors were an obligatory part of the provisions issued by the academy. It was for health reasons. You know, staying clean and dry down there. And although Annie's pussy was rarely dry, at least she tried by keeping her pubic hair shaved up."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/706a33f7-a5ce-412e-8d9f-e964bf2e5eb8/width=525/706a33f7-a5ce-412e-8d9f-e964bf2e5eb8.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 33
        }
      ]
    },
    "33": {
      "id": "33",
      "text_lines": [
        "Staying smooth was part of the health check. Like most of the health check, it wasn't uncommon for her to fail in this regard and be taken to the showers and shave again, and shave better, with a new razor. It was only one of many of Annie's failures: not staying smooth enough. I just can't seem to do anything right. I'm worthless."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/80d2c8bb-86e2-4928-8721-7e343eead10e/width=525/80d2c8bb-86e2-4928-8721-7e343eead10e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 34
        }
      ]
    },
    "34": {
      "id": "34",
      "text_lines": [
        "In the locker room, she started noticing. That's when she noticed them noticing her. Of course, everybody did. She sat in front of them. She was made to stand in front of them to answer questions. She was made to work on the blackboard at the front of the lecture hall. She was made a spectacle. Normally, she avoided eye contact. Eye contact doesn't help her ever-alert nipples and pussy."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1206f180-557f-455d-b931-ede6fbb4d8e6/width=525/1206f180-557f-455d-b931-ede6fbb4d8e6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 35
        }
      ]
    },
    "35": {
      "id": "35",
      "text_lines": [
        "In the showers, she tried to conceal her shame. But the shower was communal. There was nowhere to hide. She sought out the corner shower. But often they were taken. So she would endure the stares."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/abd48bab-70fe-486e-a2c8-5ef5b8cbbb60/width=525/abd48bab-70fe-486e-a2c8-5ef5b8cbbb60.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 36
        }
      ]
    },
    "36": {
      "id": "36",
      "text_lines": [
        "She relented to knowing the soapy water would only make her nipples even more rabid. Washing, even with the slightest touch of her own hand, sent tingles to the furthest reaches of her core. With eyes down, she would be aware of the other girls. But there was a health monitor ever-present, only watching her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4cec7aa2-363f-489f-8a8a-a8d0446745a9/width=525/4cec7aa2-363f-489f-8a8a-a8d0446745a9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 37
        }
      ]
    },
    "37": {
      "id": "37",
      "text_lines": [
        "The female monitor normally paid no regard to the others. It seemed only Annie was monitored. Annie started to feel envious, envious of the other girls. They weren't monitored like me. They were friends. They whispered together in the shower. They laughed. They had nothing to be embarrassed of."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/43b2d9ac-a3b7-40bc-8ba3-522d26a053be/width=525/43b2d9ac-a3b7-40bc-8ba3-522d26a053be.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 38
        }
      ]
    },
    "38": {
      "id": "38",
      "text_lines": [
        "Her thoughts, feelings and emotions were such a tangled mess that she didn't actually know that she was envious. But she was."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d9e9cc92-aac4-45a1-87ee-661c8d039a48/width=525/d9e9cc92-aac4-45a1-87ee-661c8d039a48.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 39
        }
      ]
    },
    "39": {
      "id": "39",
      "text_lines": [
        "Normally, Annie touches her pussy and breasts only out of the utmost necessity. Even then, she does try. She does at least try to avoid worsening her already soaring arousal. Whatever sensation or touch just seems to set her off. Walking, moving, even sleeping... you name it, drives her to insanity."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7e217333-49cf-411b-a87d-8238b6c955ab/width=525/7e217333-49cf-411b-a87d-8238b6c955ab.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 40
        }
      ]
    },
    "40": {
      "id": "40",
      "text_lines": [
        "This is what make her forced exhibition and health checks so maddening. Touch and attention prove to send her over the edge. And her academyship know it. They exploit it. Everyone seems to know it. It takes all she has to hold back her urges, feelings, and desires. Yet she does."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d40c4ccd-753c-4f19-b57d-d2db7b85790f/width=525/d40c4ccd-753c-4f19-b57d-d2db7b85790f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 41
        }
      ]
    },
    "41": {
      "id": "41",
      "text_lines": [
        "It was during one of these required and monitored re-shavings that it happened. No matter how gently Annie held her sensitive tummy, pressed, and agonizingly glided the razor, she felt the movement across her vulva. My pussy... The soapy sudsy water flowing down, across her breasts, falling onto her belly, and tapping on her dirty spot. (She didn't know the name of it yet. They hadn't gotten to those parts of the lectures.) As she brought back the razor stroke in an inadvertent disregard, her wrist and razor handle touched on the sensitive spot."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d0a09e4e-2d83-4111-8360-0cda9811f878/width=525/d0a09e4e-2d83-4111-8360-0cda9811f878.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 42
        }
      ]
    },
    "42": {
      "id": "42",
      "text_lines": [
        "She jolted. The razor fell, and she slid her fingers down almost by accident. She pressed into her pussy. But she realized that the monitor was watching. She went tense. Her tummy muscles tightened. Oh no, oh no. What is happening? She saw scribbling on the clipboard. Fight it, fight it. The monitor peered more closely over her glasses. But Annie fought, and breathed, and closed her eyes. She was able to push that seemingly unstoppable eruption down. She did not want to be dirty. Annie's first orgasm--if you can call it that--was a flickering, mocking, ruined orgasm. Her first orgasm was almost in the shower shaving, in full inspection of one of the monitors."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e3d28702-67b5-471b-9d16-4cf990b8bc28/width=525/e3d28702-67b5-471b-9d16-4cf990b8bc28.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 43
        }
      ]
    },
    "43": {
      "id": "43",
      "text_lines": [
        "Whether warranted or not, the monitors' alerts always made it back to the headmistress soon enough. Annie is irreparable. She's a lost cause, and we need to take action. We know this because Annie's arousal has reached a new apex. Annie's current state was well known. It always was. And it needed to be, by design. How else could they keep an eye on her? How else could she be used as an example? But Annie was worsening. One such monitor had noticed Annie glancing with head turned toward at least one of the other wet girls. Maybe even several. Admiring their nakedness."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6f2fcee5-17f8-486e-bbc3-f9d889dc0688/width=525/6f2fcee5-17f8-486e-bbc3-f9d889dc0688.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 44
        }
      ]
    },
    "44": {
      "id": "44",
      "text_lines": [
        "It was obvious, in this monitor's mind, that Annie had had lustful thoughts, and that her eyes had focused, rested, and remained too long on these impressionable, susceptible bodies. The bodies and the honor of these well-behaved girls must be safeguarded."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3ac059c7-9615-46d6-a747-cd983dee2040/width=525/3ac059c7-9615-46d6-a747-cd983dee2040.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 45
        }
      ]
    },
    "45": {
      "id": "45",
      "text_lines": [
        "The clipboard came out, as did the pen. Notes were furiously jotted. The monitor had noticed the flushing, reddening on the vulva and around the nipples indicative of the rush of blood, which Annie certainly graciously allowed into her genitalia."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7c5d664a-3bca-41c1-b466-3a1d1f4a2351/width=525/7c5d664a-3bca-41c1-b466-3a1d1f4a2351.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 46
        }
      ]
    },
    "46": {
      "id": "46",
      "text_lines": [
        "That intense reddening gave Annie away. And Annie had given in to lust. It had to be noted and reported."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5954a62c-3030-4e4c-b7ea-f05223b3c9a9/width=525/5954a62c-3030-4e4c-b7ea-f05223b3c9a9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 47
        }
      ]
    },
    "47": {
      "id": "47",
      "text_lines": [
        "Soon after, Annie was assigned separate bathing times, apart from the other girls. And more than one monitor, ideally at least three, must be present. All of Annie's shaving, whether it be arms, legs, asshole, and pussy, all would no longer be allowed to be performed by Annie, nor done in private."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1f987620-3217-4128-a76b-b43885616e4e/width=525/1f987620-3217-4128-a76b-b43885616e4e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 48
        }
      ]
    },
    "48": {
      "id": "48",
      "text_lines": [
        "Razor privilege was removed. Razors dedicated for Annie would be dispensed daily to any staff necessary to keep her in compliance. Shaving would be done for her, and to her, in full view of monitors. Male monitors would be brought in, seeking their unique perspective, stringent requirements, and tough enforcement. Strangers' hands would be touching, fondling, pressing, grabbing, probing, pinching, rubbing--whatever needed to do be done, what Annie failed to manage herself."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/96b220a4-96e7-415a-b3db-4100c250f502/width=525/96b220a4-96e7-415a-b3db-4100c250f502.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 49
        }
      ]
    },
    "49": {
      "id": "49",
      "text_lines": [
        "Annie could no longer be trusted. While her pussy dripped, and standing fully raw, fully humiliated, and defenseless immediately in front of the headmistress, she was told as much. She was told that she was regressing. That she should be thankful the academy cares enough to not give up on her. She felt crushed. She failed yet again. Annie felt like a failure... and even more alone. And even more watched, and even more on display."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a2a4b77c-8819-40b1-9010-0ca9f233ad1a/width=525/a2a4b77c-8819-40b1-9010-0ca9f233ad1a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 50
        }
      ]
    },
    "50": {
      "id": "50",
      "text_lines": [
        "It's going to be a waking nightmare for Annie..."
      ],
      "next": [
        {
          "text": "Chapter 3 - Discipline for Annie",
          "next": 51
        },
        {
          "text": "Back to Index",
          "next": "16"
        }
      ]
    },
    "51": {
      "id": "51",
      "text_lines": [
        "# Chapter 3",
        "## Discipline for Annie"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fa65b331-08c7-4e16-8da9-aa8f10a0d225/original=true/83.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 52
        }
      ]
    },
    "52": {
      "id": "52",
      "text_lines": [
        "In her brief time, Annie had thus far been an utter failure at the higher academy. It was painfully apparent that she was unteachable. She had so far proven that she was determined to not control her arousal, to instead let her mind and body control her. On day one, after failing the first health check, she was admonished about the importance of a clean mind and body. She had said she understood. She had said she was sorry. But she didn't... and she wasn't. Every day that followed, her pussy was always wet and slippery, swollen in desire. Her nipples were always rock-hard and enflamed with sensitivity. She had made her lustful desires apparent in the showers. She couldn't even perform basic hygiene tasks without incident. Shaving her pubic hair had almost sent her into orgasm."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/963d409d-2572-4c82-aba6-7e0360aeb755/width=525/963d409d-2572-4c82-aba6-7e0360aeb755.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 53
        }
      ]
    },
    "53": {
      "id": "53",
      "text_lines": [
        "She had not yielded to the kind care and guidance given to her by the academy. They were committed to her well-being, and she betrayed that commitment. She had been counseled about the importance of a clean mind and body. Yet she ignored any instruction. She actively fought against any training, every minute of every day. She was repeatedly reminded of her failures."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ce64a32e-7e82-45a5-a63e-4f299fd9e6c1/width=525/ce64a32e-7e82-45a5-a63e-4f299fd9e6c1.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 54
        }
      ]
    },
    "54": {
      "id": "54",
      "text_lines": [
        "She allowed her body to present disgracefully, even when exposed publicly, showing no regard for others. She was told how dirty she was. She knew it. I'm a lost cause. What's wrong with me? I feel so horny. I can't stop thinking about my nipples and pussy. Everyone sees them. They are so sensitive, it's driving me crazy. It's so embarrassing. They can see how terrible I am."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/27f17b66-7198-408c-af03-887e7375e8a2/width=525/27f17b66-7198-408c-af03-887e7375e8a2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 55
        }
      ]
    },
    "55": {
      "id": "55",
      "text_lines": [
        "Yet, she continued to disobey. Discipline had become necessary. Privileges had been revoked. But the headmistress was gracious enough as to allow Annie her dignity. She permitted Annie to attend lectures wearing stockings and her necktie. But her shame, her body, her arousal, and her defiance must be displayed publicly. How else would they get through to her? How else would the others learn from her rebellion?"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b6e32c8c-839f-4363-8bb1-19c672acd540/width=525/b6e32c8c-839f-4363-8bb1-19c672acd540.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 56
        }
      ]
    },
    "56": {
      "id": "56",
      "text_lines": [
        "Annie's rebelliousness was obvious. Never once was she found unaroused. Not a day passed that Annie did not present her failures to the staff, faculty, and academicship. Her body, pussy, and nipples proved it. Everyone could see her defiance."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/43efa3d5-6ab5-405d-9ba1-4ce895809ef9/width=525/43efa3d5-6ab5-405d-9ba1-4ce895809ef9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 57
        }
      ]
    },
    "57": {
      "id": "57",
      "text_lines": [
        "So Annie was discussed in depth. What were they to do with her? Her failures became their opportunities. They would at least make an example of her to benefit others. Because her failures had become so eggregious, under the concensus of the administration, the headmistress agreed that more intense training would be necessary. They would not give up."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4cb14102-0b92-410f-921b-f2b580d19da7/width=525/4cb14102-0b92-410f-921b-f2b580d19da7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 58
        }
      ]
    },
    "58": {
      "id": "58",
      "text_lines": [
        "After suspicion of the health monitors, hidden cameras were installed in Annie's private dorm and shower. And the footage proved their suspicions to be accurate."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e87764ab-af70-44ba-af22-2052abcc10f4/width=525/e87764ab-af70-44ba-af22-2052abcc10f4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 59
        }
      ]
    },
    "59": {
      "id": "59",
      "text_lines": [
        "It documented Annie's continued and heightened lust. In several instances, it could be seen that her fingers did indeed sweep across her pussy and tap on her clitoris. It was obviously more than a simple mistake. She had touched herself sexually."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c057be21-c197-4aa6-8278-94694b609a1b/width=525/c057be21-c197-4aa6-8278-94694b609a1b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 60
        }
      ]
    },
    "60": {
      "id": "60",
      "text_lines": [
        "This would only lead to self-pleasuring. And that could not happen. It was too important not to take more drastic measures. Annie was confronted and shown the footage. And despite her feeble denials, the case was closed. She had failed again."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f8f0432e-81ab-42e9-9e35-cd2da8a0ea85/width=525/f8f0432e-81ab-42e9-9e35-cd2da8a0ea85.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 61
        }
      ]
    },
    "61": {
      "id": "61",
      "text_lines": [
        "The headmistress knew what would be best for Annie. Annie would undergo intensive daily medical exams, during which she would be fitted for her custom butt plug. Annie needed this. It would be her most intimate reminder. It would serve as constant admonition. She would feel the shame of it. But first, it was necessary to prep her colon and rectum for the butt plug."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2855e8cb-37df-42b8-aa5f-d834c2b49210/width=525/2855e8cb-37df-42b8-aa5f-d834c2b49210.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 62
        }
      ]
    },
    "62": {
      "id": "62",
      "text_lines": [
        "After being awoken far earlier than the others that morning, and after Annie's involuntary shaving and moisturizing regimen, she would be allowed a single and complete defecation. She would be allowed only one, and this would be it. (No more sneaking off into the bathroom. Who knows what she may be hiding from the monitors there?)"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ca46b126-216f-483a-a0bc-95698f0aaf9d/width=525/ca46b126-216f-483a-a0bc-95698f0aaf9d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 63
        }
      ]
    },
    "63": {
      "id": "63",
      "text_lines": [
        "Annie was told she requires some clinical treatment for her condition. That was that. No debate. She knew not to question authority. That would only make things worse. I can't make things worse for myself. I've got to try harder. Annie reported to a different health check exam room than she'd ever been to. Several health monitors and a technician were present. They looked at her with disdain. They were unknown to Annie too. But what was the same was that she still arrived in her usual and customary state of arousal and stimulation. That never changes. It's a fact: her pussy and nipples never have time off."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ee8eb791-6422-4486-8456-3225e3f686ea/width=525/ee8eb791-6422-4486-8456-3225e3f686ea.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 64
        }
      ]
    },
    "64": {
      "id": "64",
      "text_lines": [
        "Total evacuation was simply the right thing to do. This would allow the butt plug to remain inserted throughout the entire day and evening. But Annie, as of now, was not aware of her new routine. There would be little, if any, relief. It was known that any discipline, especially any discipline for Annie, needs to be both constant and consistent."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/863c4c03-3f39-447e-abea-1619ec52878b/width=525/863c4c03-3f39-447e-abea-1619ec52878b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 65
        }
      ]
    },
    "65": {
      "id": "65",
      "text_lines": [
        "Annie's rectum was super sensitive, just like the rest of her body. Any touch would send her up to the edge, not over it. She was never allowed to go over it. Annie looked wide-eyed at the monstrous hose. Oh, no, no please, no. I can't. A huge, silver colonic tube with a large round nozzle was inserted deep inside Annie."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/45dc0ab6-3014-4fc1-9e6b-5cca49883e71/width=525/45dc0ab6-3014-4fc1-9e6b-5cca49883e71.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 66
        }
      ]
    },
    "66": {
      "id": "66",
      "text_lines": [
        "Oh, oh, oh, oww. Why are they doing this? W-w-what is happening? The tube pumped pressurized lubricious fluid until Annie thought she would burst. The technician swore he could see some pleasure apparent in her face, nipples, and pussy. He pointed to a monitor and whispered. The monitor made notes on a clipboard. He noticed some urine flow down her perineum."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5b972d1d-7f13-483b-b6e7-cefea8464fd1/width=525/5b972d1d-7f13-483b-b6e7-cefea8464fd1.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 67
        }
      ]
    },
    "67": {
      "id": "67",
      "text_lines": [
        "The tube was removed, and Annie was given important clinical instruction that she must hold it for 15-minutes for it to work. Otherwise, the procedure would need to be repeated. Annie didn't want that. So she gritted her teeth and bore the humiliation. After what seemed an eternity and several strong convulsions, a second, larger hose was inserted. Okay, missie, you can let it out. She let go, and in a prolonged and humiliating rush, she was finally empty. I'm so embarrassed. Did that just happen? She could see the technician smirking in disgust."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/10ed0157-8b03-4ed2-8e71-d1cc37b6ade4/width=525/10ed0157-8b03-4ed2-8e71-d1cc37b6ade4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 68
        }
      ]
    },
    "68": {
      "id": "68",
      "text_lines": [
        "Next, a health official appeared. Annie's rectum was lubricated with a gloved hand. His finger went deep, really deep. He withdrew and inspected the gloved finger. It was clean. Oh my g-g-g, this is embarrassing. My day just can't get worse than this. A clean, ungloved finger was next inserted. He moved his finger all around. She felt the pressing. It too was removed and inspected. Then a nod. It was clean. After some private whispers with the health monitors, Annie could see out of the corner of her eyes, some nodding assention. The official returned only to re-apply lubricant and open his pants."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/32f170c6-6270-4eae-a8c9-0e7348affe82/width=525/32f170c6-6270-4eae-a8c9-0e7348affe82.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 69
        }
      ]
    },
    "69": {
      "id": "69",
      "text_lines": [
        "Annie hadn't before seen a penis. She'd heard about them during lectures, and whispers by the girls in the locker room. She had no idea. She thought they would be smaller than that. The official noticed her wide eyes, and turned back to the monitors with some motions. Oh no. Why did I look? She reminded herself to not make eye contact after being caught sneaking a glance. This penis was inserted into her, gradually first, and then far too suddenly. Oww. Don't cry, don't make a peep. Hold it inside. It went really deep. Tears welled up. Indeed, it had gone balls-deep into her. It remained and she wondered. What is happening? Notes were being taken regarding her state. Then, with what she felt as several aggressive pumps, suddenly it withdrew. She could feel her pussy drip along her thigh. And she felt that same rush deep inside herself. That same one she sensed back during her ruined first orgasm. She was so ashamed of her body."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6ce2320e-132a-4d05-975e-f23ab47597da/width=525/6ce2320e-132a-4d05-975e-f23ab47597da.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 70
        }
      ]
    },
    "70": {
      "id": "70",
      "text_lines": [
        "Annie's anus must be evaluated, measured and photographed. It's prudent when fitting for a butt plug. Too small a butt plug would not provide ample discipline. Too large simply would create complications. An instrument was inserted and inflated."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f98cc407-48a7-470e-970b-1e31cfd9f4a9/width=525/f98cc407-48a7-470e-970b-1e31cfd9f4a9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 71
        }
      ]
    },
    "71": {
      "id": "71",
      "text_lines": [
        "These various insertions were wreaking havoc on her arousal state. She tried in vain to conceal pleasure. Her nipples and pussy betrayed her. More notes were jotted."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1919d46a-50e6-465d-9873-7f498816777d/width=525/1919d46a-50e6-465d-9873-7f498816777d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 72
        }
      ]
    },
    "72": {
      "id": "72",
      "text_lines": [
        "Plugs of various shapes and designs appeared on a clinical looking tray. Annie peeked. And she grimaced. One by one, these clever, sadistic medical devices were inserted and evaluated. She couldn't move. For each, more notes were made and photographs taken."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/bc233280-777d-4d56-a366-ea19b9a58b80/width=525/bc233280-777d-4d56-a366-ea19b9a58b80.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 73
        }
      ]
    },
    "73": {
      "id": "73",
      "text_lines": [
        "Finally, a size and shape were settled on, and the last device was pressed with difficulty into Annie. There you go, for now, sweetie. For now? What Annie didn't realize were the plans already made for larger devices of ever-increasing size to drive home the message."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9cb68ddd-d543-4bb7-bebc-152ea5d1697c/width=525/9cb68ddd-d543-4bb7-bebc-152ea5d1697c.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 74
        }
      ]
    },
    "74": {
      "id": "74",
      "text_lines": [
        "What? Haven't you been told? You should go report to the headmistress. This is your punishment. Wear it with pride. And he winked. B-b-but not this, it's, it's too big. The health monitors approached disapprovingly, and Annie stopped her pleading."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/55182145-feda-46c8-b2ab-7cad87e18bed/width=525/55182145-feda-46c8-b2ab-7cad87e18bed.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 75
        }
      ]
    },
    "75": {
      "id": "75",
      "text_lines": [
        "Now, dejected, she realized this was to be worn at all times. Her constant reminder. Her constant shame."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7a1f70c4-d017-409d-b37d-ee5a10378a9e/width=525/7a1f70c4-d017-409d-b37d-ee5a10378a9e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 76
        }
      ]
    },
    "76": {
      "id": "76",
      "text_lines": [
        "Annie gingerly rolled off of the table. She was required to present her new adornment to the group. She was notified she will be presenting it daily to the entire assembly, as well as to the academicship at each lecture."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6f749d6d-ac53-40ad-8681-fdf50181fec8/width=525/6f749d6d-ac53-40ad-8681-fdf50181fec8.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 77
        }
      ]
    },
    "77": {
      "id": "77",
      "text_lines": [
        "Keeping her butt plug in place was not difficult for Annie. The perpetual, pulsating contractions of her anus clenching down pointlessly against it could not expel such a device. It was so large and necked down so drastically that it couldn't slip out. But on the other hand, it was so large that she felt it with each breath, with each heartbeat, with each step, and with each passing second. Constant awareness. It caused her to walk the halls even more sensuously, taking great care to keep her arousal in check."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b0bbd643-7b02-44da-b0bc-f3067e03ce8a/width=525/b0bbd643-7b02-44da-b0bc-f3067e03ce8a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 78
        }
      ]
    },
    "78": {
      "id": "78",
      "text_lines": [
        "But that caused her breasts to bounce and sway even more awkwardly. She was even more noticeable. Girls pointed and whispered."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/017663a6-3e94-4e6e-a1d4-0b41737270e5/width=525/017663a6-3e94-4e6e-a1d4-0b41737270e5.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 79
        }
      ]
    },
    "79": {
      "id": "79",
      "text_lines": [
        "She saw there was a great, brilliant jewel on the back side of her ass. And everyone could see it. It was eye-catching and blatantly obvious. She heard laughing."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/01264ad9-75fa-4f2e-85de-f9994fa451bf/width=525/01264ad9-75fa-4f2e-85de-f9994fa451bf.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 80
        }
      ]
    },
    "80": {
      "id": "80",
      "text_lines": [
        "She presented her punishment to the headmistress, who told Annie this is what happens when you are dirty. You're filthy Annie. I'd hate to know what's going on in that head of yours. But I can tell by looking at you that it's appalling. You should be ashamed. She was. She was so ashamed. Still bent over the desk, she looked at the ground while enduring another reprimand."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/dd887b31-5a57-4cfc-b7b7-c2c7feefcbc0/width=525/dd887b31-5a57-4cfc-b7b7-c2c7feefcbc0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 81
        }
      ]
    },
    "81": {
      "id": "81",
      "text_lines": [
        "After previously failing in the academic showers with other girls, it was made mandatory that Annie showers with the female staff each day. These women were older, and many she knew from lectures or as health monitors. She felt their stares."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fa816afc-699e-419c-b814-1b6aa4deeba8/width=525/fa816afc-699e-419c-b814-1b6aa4deeba8.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 82
        }
      ]
    },
    "82": {
      "id": "82",
      "text_lines": [
        "The butt plug caused her skin to feel flushed and sweaty without ceasing. Her skin stayed shiny, which made her body stand out and her failures easy to identify. It also made her pussy even wetter, and made her breasts even larger and caused her nipples to protrude even more. She could not protest. She just had to endure it. And keep failing."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ca8fe0a1-9298-4931-8a59-e314e34dd349/width=525/ca8fe0a1-9298-4931-8a59-e314e34dd349.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 83
        }
      ]
    },
    "83": {
      "id": "83",
      "text_lines": [
        "She was held at the bitter edge. There was no relief. Annie was told she failed in the female staff shower too. Some staff had reported Annie glancing, and it made them uncomfortable. They complained and no longer wanted to endure Annie's purported advances. No one wants to shower with a slut."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5d05b1a9-b823-4253-99cb-3ef2b0907bb0/width=525/5d05b1a9-b823-4253-99cb-3ef2b0907bb0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 84
        }
      ]
    },
    "84": {
      "id": "84",
      "text_lines": [
        "So the difficult decision had to be made to send Annie over to shower with the male staff. She was heartbroken. Why am I like this? Am I a slut? I must be."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/76bb4af6-6074-440c-abd7-39babd3dcfda/width=525/76bb4af6-6074-440c-abd7-39babd3dcfda.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 85
        }
      ]
    },
    "85": {
      "id": "85",
      "text_lines": [
        "What was necessary for Annie was the rigorous attention and incessant jeering of the male communal shower. Fear is a motivation."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7be2ba8b-ccea-4d28-b18d-c25ab80e4966/width=525/7be2ba8b-ccea-4d28-b18d-c25ab80e4966.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 86
        }
      ]
    },
    "86": {
      "id": "86",
      "text_lines": [
        "Fear of intense stares, and fear of being in the presence of large men with engorged penises will surely be enough to make her rethink her disobedience."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a3661f03-920c-48d0-a438-8eb42c642324/width=525/a3661f03-920c-48d0-a438-8eb42c642324.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 87
        }
      ]
    },
    "87": {
      "id": "87",
      "text_lines": [
        "This is how it must be. So Annie did shower with men. A long shower. She showered with the butt plug. She showered feeling her tender breasts and nipples on fire. She showered feeling her aching pussy."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/39576729-7c70-4fc6-8895-6845941c1bf6/width=525/39576729-7c70-4fc6-8895-6845941c1bf6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 88
        }
      ]
    },
    "88": {
      "id": "88",
      "text_lines": [
        "She showered trying to block out the comments. She showered trying to avoid looking at or bumping into penises. That was quite impossible."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cb414f73-5260-4b39-9643-6b456f955a31/width=525/cb414f73-5260-4b39-9643-6b456f955a31.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 89
        }
      ]
    },
    "89": {
      "id": "89",
      "text_lines": [
        "And she did think."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8e6d7c09-009f-47e0-9317-4243e9df1204/width=525/8e6d7c09-009f-47e0-9317-4243e9df1204.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 90
        }
      ]
    },
    "90": {
      "id": "90",
      "text_lines": [
        "She thought about what a failure she is. And how she is going to be able to do this again tomorrow, and the next day... for the rest of the term. A tear dropped to the shower floor."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/730659c6-e1d9-4a19-a41f-0b07905585be/width=525/730659c6-e1d9-4a19-a41f-0b07905585be.jpeg"
      },
      "next": [
        {
          "text": "Back to Index",
          "next": "16"
        },
        {
          "text": "Chapter 4 - Annie's first counseling session",
          "next": "91"
        }
      ]
    },
    "91": {
      "id": "91",
      "text_lines": [
        "# Chapter 4",
        "## Annie's first counseling session"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d47a592b-b942-4d6f-94be-fa64cb67a15c/width=1320/36.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-1"
        }
      ]
    },
    "92": {
      "id": "92",
      "text_lines": [
        "# Chapter 5",
        "## Annie learns some restraint"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/31a9b315-7f00-4095-a933-e60741054ba0/width=1320/0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-1"
        }
      ]
    },
    "93": {
      "id": "93",
      "text_lines": [
        "# Chapter 6",
        "## Annie starts modeling"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/386ab2e0-4550-4056-9b1f-9e7832607372/width=1320/---01KV2J6R1ZFGHG8V4CP62BNW70.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-1"
        }
      ]
    },
    "c3-1": {
      "text": "There was a knock at the door. Come in. It sounded like a pleasant man's voice. Annie could let out her breath. Annie slowly turned the doorknob and pushed open the door. She stood frozen. And humiliated having to meet with another superior. The man took off his glasses, and looked up from a stack of paperwork. His countenance changed. Oh, you must be Annie. Annie, come!",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/029fa1e4-002e-48e1-b3c0-6c9e2424296e/width=525/029fa1e4-002e-48e1-b3c0-6c9e2424296e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-2"
        }
      ],
      "id": "c3-1"
    },
    "c3-2": {
      "text": "Annie's metallic butt plugs continued their progression in size. And it would continue to as long as her insubordination did. Her discomfort was apparent. Yet she still fought against the decency that the academy demanded of her.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0d4afcaa-0953-47c5-87de-2ef242b3fbd9/width=525/0d4afcaa-0953-47c5-87de-2ef242b3fbd9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-3"
        }
      ],
      "id": "c3-2"
    },
    "c3-3": {
      "text": "No matter the size of the massive butt plug, no matter the amount of forced exhibitionism, no matter the humiliation, Annie's raging nipples and aching pussy would simply not obey. She was obviously a slut. And this needed to change. So the headmistress pronounced that Annie would attend counseling sessions each evening.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8662ff82-fb20-4077-a97d-50e92dd2d30a/width=525/8662ff82-fb20-4077-a97d-50e92dd2d30a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-4"
        }
      ],
      "id": "c3-3"
    },
    "c3-4": {
      "text": "The psychiatrist had been briefed. Annie had a dirty mind and body. And when she first arrived, he could immediately see that the brief was accurate. He was appalled at her brazen display of her breasts and ass. She entered like the horniest creature he had ever laid eyes upon.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b6aabbaf-2218-4d39-a18c-06d934b90529/width=525/b6aabbaf-2218-4d39-a18c-06d934b90529.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-5"
        }
      ],
      "id": "c3-4"
    },
    "c3-5": {
      "text": "Her pussy looked like it had been buffed smooth, shiny and glistening from moisture. Her skin looked like it had been thoroughly moisturized with mineral oil, slippery and slick. But these features were plain and simple involuntary phenomena resulting from arousal. It didn't take a professional to see that.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/699ae714-c778-4ddf-8868-fcd17b78608b/width=525/699ae714-c778-4ddf-8868-fcd17b78608b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-6"
        }
      ],
      "id": "c3-5"
    },
    "c3-6": {
      "text": "This girl was stubborn. She refused to comply with the academy's strict standards despite all the discipline so far. She opposed all efforts at loving correction up to this point. He knew that her filthy urges and slutty desires run deep. He knew her arousal was like a powder-keg ready to explode if she were reckless enough to light a spark.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7f5eeb60-eb79-4b17-9b90-25df292dde8d/width=525/7f5eeb60-eb79-4b17-9b90-25df292dde8d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-7"
        }
      ],
      "id": "c3-6"
    },
    "c3-7": {
      "text": "Immediately, he knew this girl needed to be broken. She had shown herself set against correction. And this would require long sessions and intense mental deconstruction. In an effort to establish her inferiority and defectiveness, Annie would not be treated as a victim. She needed harsh rehabilitation. So, with a motion of his hand, Annie was directed toward a leather love-seat immediately opposite the imposing man.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a99fb60a-5aea-4dbd-8922-327086081aa6/width=525/a99fb60a-5aea-4dbd-8922-327086081aa6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-8"
        }
      ],
      "id": "c3-7"
    },
    "c3-8": {
      "text": "Annie, kneel! Annie froze. Kneel on the loveseat there, slut! She knelt.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d801f347-9974-4cf6-99a6-5795545f4926/width=525/d801f347-9974-4cf6-99a6-5795545f4926.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-9"
        }
      ],
      "id": "c3-8"
    },
    "c3-9": {
      "text": "Annie, lay down! She was confused. He took a breath. He looked agitated, and then spoke softly and slowly so as to demean her. Lay... on... your... back. She did as she was told.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c35eee22-3cca-4eca-8070-4a559162e426/width=525/c35eee22-3cca-4eca-8070-4a559162e426.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-10"
        }
      ],
      "id": "c3-9"
    },
    "c3-10": {
      "text": "Annie, turn over! His eyebrows raised. She was fearful, and she turned over. You might be getting the hang of it. All of her movements were slow, deliberate, and sensual. He understood the butt plug made any motion extremely difficult for her... and very arousing. She was trying to be careful. He quickly pushed the half-smile from his lips.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/27421507-56da-46b5-a1e9-6f39f33a4b9a/width=525/27421507-56da-46b5-a1e9-6f39f33a4b9a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-11"
        }
      ],
      "id": "c3-10"
    },
    "c3-11": {
      "text": "Now... Annie, sit! She sat gingerly at the side of the love-seat, legs pressed tightly together, arms awkwardly crossing and uncrossing, yet unable to conceal her huge breasts. Tears welled up. But he saw through her timid act.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/37dc16ab-36b7-4c22-870a-8270e69183f6/width=525/37dc16ab-36b7-4c22-870a-8270e69183f6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-12"
        }
      ],
      "id": "c3-11"
    },
    "c3-12": {
      "text": "Not there, you slut! Sit in front of me, here, directly in front. She eased over to the center cushion. The leather was cold and slippery. Her adjustment inadvertently sent tingles through her clitoris. She felt her nipples harden up and extend. She glanced down and confirmed their arousal.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6c939c6f-b08f-466e-81d6-45687d4d531e/width=525/6c939c6f-b08f-466e-81d6-45687d4d531e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-13"
        }
      ],
      "id": "c3-12"
    },
    "c3-13": {
      "text": "You are an insubordinate one, aren't you? This is how you present yourself to me, slut? That's not how you will sit before me in sessions. Present yourself to me like the slut you are. C'mon. Sit back, legs apart. Expose your shame.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d3373fc0-e895-412d-8fcc-c363b1fdb5c2/width=525/d3373fc0-e895-412d-8fcc-c363b1fdb5c2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-14"
        }
      ],
      "id": "c3-13"
    },
    "c3-14": {
      "text": "That means display your pussy, slut! Spread your legs! That's right, knees up. Put your feet there.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2990d725-2dba-4686-9961-797f01d5c948/width=525/2990d725-2dba-4686-9961-797f01d5c948.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-15"
        }
      ],
      "id": "c3-14"
    },
    "c3-15": {
      "text": "Wider! Wow, you are a stubborn, stupid bitch.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b758714f-9bb7-4fb0-9238-38aa996ae931/width=525/b758714f-9bb7-4fb0-9238-38aa996ae931.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-16"
        }
      ],
      "id": "c3-15"
    },
    "c3-16": {
      "text": "He pulled his large, leather chair close. His legs almost touching her overhanging toes. But you will learn, won't you? Present your butt plug, bitch. Dear God, do I have to instruct you on how to behave like a lady? It appears so. Show it to me, slut! There, now that's pretty. Well, aren't you the picture of wholesomeness.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cb3d9af5-2351-49b3-8901-be56d539d778/width=525/cb3d9af5-2351-49b3-8901-be56d539d778.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-17"
        }
      ],
      "id": "c3-16"
    },
    "c3-17": {
      "text": "He shook his head and snickered mockingly. Actually, you look like the slut you are. You do know you're a slut, right? I hope you're not actually that stupid. We don't have to start back at square-one now do we? Her mind was reeling. Annie nodded. She knew she was. That fact had been pointed out to her every day in the preceding months since arriving at the academy.",
      "next": [
        {
          "text": "",
          "next": "c3-18"
        }
      ],
      "id": "c3-17"
    },
    "c3-18": {
      "text": "Everyone noticed her failures daily. Her body as well as her behavior had been highlighted incessantly. But she could not help herself. Her libido was on the razor's edge every moment of every day. She felt it. Oh, how she felt it. Fortunately for Annie, the academy had not given up on her.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b0fe93f9-a3ce-4c21-b4ef-0b2aeea66d46/width=525/b0fe93f9-a3ce-4c21-b4ef-0b2aeea66d46.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-19"
        }
      ],
      "id": "c3-18"
    },
    "c3-19": {
      "text": "She had been shown her shortcomings every day and in every lecture. The glimmer of hope hadn't yet been extinguished. She might be able to be like the other girls. Could she? No, I'm not like the other girls. Even the female staff and faculty feel uncomfortable around me. They refuse to have me in their showers. Annie was relegated to showering with the male staff. And they drew the unfortunate assignment of monitoring Annie's arousal... at least while showering. For her insubordination, it became their duty to help to cause her the most extreme anguish. Touching and fondling were not off limits. No, they were encouraged. Up to the edge--but not over. Whatever the agony could be inflicted upon Annie, the more hopeful the academy were for rehabilitation. Whatever... means... necessary. For a clean mind and clean body were the cornerstones the academy was built upon. Suddenly, Annie's mind snapped back.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8122e80d-f7d5-461e-aa30-96cd9bf5df51/width=525/8122e80d-f7d5-461e-aa30-96cd9bf5df51.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-20"
        }
      ],
      "id": "c3-19"
    },
    "c3-20": {
      "text": "Slut? Slut! Are you even listening, slut? I was saying I've read the stacks of notes from all of your failed health checks stating as much. I've never seen a girl fail every single health check. Only a slut would be that talented. I've read about your defiance. And see? Right now, I see it continues. Look at your nipples, slut. She looked. You're flashing your nipples in my face. Is this the esteem in which you hold authority, slut? Annie didn't know how to answer. Her face was blank and blushing. She felt embarrassed.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/902662bd-cd56-48ee-93e1-2cc75eb8e02b/width=525/902662bd-cd56-48ee-93e1-2cc75eb8e02b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-21"
        }
      ],
      "id": "c3-20"
    },
    "c3-21": {
      "text": "Look there, beside you. You left a wet streak staining my cushion. Right now, in front of me, look, your pussy's still dripping. I think I can smell your pussy juices. Yep, I can smell them. You even smell like a slut. Are you ever not aroused? Answer me. Annie shook her head. I thought so.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4efa33a0-55b5-4a18-9297-72b7a6107d50/width=525/4efa33a0-55b5-4a18-9297-72b7a6107d50.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-22"
        }
      ],
      "id": "c3-21"
    },
    "c3-22": {
      "text": "I was told that you showered this morning. Is that right? Annie nodded with head down, peeking up. Wow, you are a dirty one, aren't you? She nodded. I will be writing the headmistress prescribing a daily second shower. Do you understand, slut? Her mouth opened. She went pale. Do... you... understand? He sighed deeply. With tears welling up in her eyes, she reluctantly nodded. I'm going to have to clean up after you, aren't I? She nodded. Okay, then, despite your lack of effort, I will do that for you Annie, because I care. I guess it's just my turn to clean up after you now.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7d514d9b-9427-49f5-89d4-7fe18742fdd3/width=525/7d514d9b-9427-49f5-89d4-7fe18742fdd3.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-23"
        }
      ],
      "id": "c3-22"
    },
    "c3-23": {
      "text": "Then he pointed. And that. That pretty, tight asshole. Yes, slut, you can't hide it. I can see you have the nerve to be clenching down on your butt plug with me sitting right here--only a couple feet away. It almost seems like you like that butt plug inside you. I can see it pulsing. That means you're enjoying it. Annie couldn't stop. She hadn't thought about it, or rather couldn't think about it, but the clenching had become second-nature. Clenching was reflexive. And it was reflective of Annie's special agony and torment she felt inside... all the time.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7a77bb81-442c-436b-8f5b-722c72b69118/width=525/7a77bb81-442c-436b-8f5b-722c72b69118.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-24"
        }
      ],
      "id": "c3-23"
    },
    "c3-24": {
      "text": "Only a slut would be so horny that they try, in front of a superior no less... try in vain to derive pleasure from a butt plug of that size. You sicken me, slut! He leaned in. And with an outstretched arm, he flicked his finger against Annie's butt plug jewel. Annie reflexively gasped.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fa19407b-540b-4d94-a39f-544404651177/width=525/fa19407b-540b-4d94-a39f-544404651177.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-25"
        }
      ],
      "id": "c3-24"
    },
    "c3-25": {
      "text": "That sent a wave of lightning straight into Annie's clitoris. She bit her lip and closed her eyes. She grabbed the cushion behind her head. With prolonged and spirited effort, she fought back this wave just like her couple ruined orgasms before this one.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/713bbe86-6826-4c41-ada2-09af5983f626/width=525/713bbe86-6826-4c41-ada2-09af5983f626.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-26"
        }
      ],
      "id": "c3-25"
    },
    "c3-26": {
      "text": "She peeked discreetly through her watery eyelids to see the psychiatrist smirking. Did that just send you over the edge? It better not have! Don't worry, slut. Myself and this academy care too much about you to let you come. Come? Come where? Annie didn't know what he meant. But she knew that feeling had almost become shameful. Too shameful to let it reach fruition. More shameful than that which she already had.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/13ca1be3-930e-41a8-839b-84439f21ba7b/width=525/13ca1be3-930e-41a8-839b-84439f21ba7b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-27"
        }
      ],
      "id": "c3-26"
    },
    "c3-27": {
      "text": "Well, we will continue this tomorrow... for as long as it takes. I have better things to do with my evening than to waste my time trying to rehabilitate this academy's one and only slut. He shook his head. Up, slut! Out with you. You sicken me. And as delicately as Annie had entered and sat, she stood, her body inches from his face, and eased by, careful not to bump him with her breasts.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/906d7f8a-dfeb-420c-959d-fbbcaf295a89/width=525/906d7f8a-dfeb-420c-959d-fbbcaf295a89.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c3-28"
        }
      ],
      "id": "c3-27"
    },
    "c3-28": {
      "text": "C'mon! Out with you. I've got to clean up. And you need a shower!",
      "id": "c3-28",
      "next": [
        {
          "text": "Chapter 5 - Annie learns some restraint",
          "next": 92
        },
        {
          "text": "Back to Index",
          "next": "16"
        }
      ]
    },
    "c5-1": {
      "text": "Enter, slut!. Annie eased into his office as gracefully as her ominous butt plug and furious arousal would allow her. He sneered. He made sure as to let her see his disgust when she lifted her eyes.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/23d85280-4e08-4d11-beb4-abf5b84b5e86/width=525/23d85280-4e08-4d11-beb4-abf5b84b5e86.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-2"
        }
      ],
      "id": "c5-1"
    },
    "c5-2": {
      "text": "Sit, slut! Yesterday's counseling session had taken a toll. Her mind was exhausted but her body on full alert. He was already seated in front of the love-seat, which caused her to have to gently and carefully ease by the daunting man without accidentally bumping her sensitive boobs into him. Present yourself to me, slut! Annie assumed her position, which was her lesson yesterday during her first session. Humiliated, she slowly reclined and spread her legs.",
      "next": [
        {
          "text": "",
          "next": "c5-3"
        }
      ],
      "id": "c5-2"
    },
    "c5-3": {
      "text": "Are you dense? Hurry up. Show it to me, show me your prized possession. She raised her pussy so as to display her jeweled butt plug. Wider, slut! He sighed. I don't want to have to go through this every time, you stupid bitch. There, now don't you look pretty. He chuckled.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/53f3ba66-0200-4368-85dd-55e4c53b4243/width=525/53f3ba66-0200-4368-85dd-55e4c53b4243.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-4"
        }
      ],
      "id": "c5-3"
    },
    "c5-4": {
      "text": "I hear today you were on even worse behavior. Don't think I'm unaware. I know everything about you, slut. You know that, right? She timidly nodded. I'm not sure you do. Our staff and faculty keep me updated. I review your failures with the headmistress every day. I hear about your stubborn insubordination. He sighed. Hell, your peers... no, no, your, your... those you attend with, your once-peers rather. I won't demean them by calling them your peers. They at least have clean minds and bodies. You're the only filthy slut we have here. But I digress. They see your failures and keep us updated when you think you're not watched. You're so disgraceful, you have forced us to even place hidden cameras in your dorm, restroom, and shower. Annie's eyes widened with fear. That's right, slut. We see it all, and it's being documented.",
      "next": [
        {
          "text": "",
          "next": "c5-5"
        }
      ],
      "id": "c5-4"
    },
    "c5-5": {
      "text": "By your brazen display yet again of these erect nipples and that dripping pussy, I can clearly see you are still unwilling to control yourself. You still fight against the loving discipline of your butt plug. I see it, slut. You're still clenching against it. Right there, pulsing. I-I-I c-c-can't help it. You're right, Annie. A slut can't help it. She felt it constantly inside herself, big and deep inside. She felt the justifiable desire to squeeze and push against it. She felt the unsolicited urges it produced. She fought it, but not on purpose. Like all her reactions, it was reflexive. She couldn't help it. But she knew that she needed to try harder.",
      "next": [
        {
          "text": "",
          "next": "c5-6"
        }
      ],
      "id": "c5-5"
    },
    "c5-6": {
      "text": "A butt plug is intended for discomfort. It's punishment. Only a slut like you strives to turn that intended discomfort into their own pleasure. That's why you're in this predicament, because you crave arousal. It's what you desire. It's like your asshole is thirsty for it, begging for it. She didn't know for what. She was confused. He pondered. I'm far past disappointment with you. A better word is disgust. I'm disgusted by you, slut. Tears welled in her eyes.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/419b4df9-23de-4089-9a95-63e822ad5d43/width=525/419b4df9-23de-4089-9a95-63e822ad5d43.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-7"
        }
      ],
      "id": "c5-6"
    },
    "c5-7": {
      "text": "Since you're unwilling to exercise the slightest modicum of restraint, slut, I've decided you will need to feel what some restraint feels like. Will that help stop you from failing? She had no idea what he was talking about, or how to answer. She nodded unknowingly. Yes? He raised his eyebrows. She didn't know. Or no? She shook her head. Which is it, slut? She nodded in confusion. Okay then. This is for your own good.",
      "next": [
        {
          "text": "",
          "next": "c5-8"
        }
      ],
      "id": "c5-7"
    },
    "c5-8": {
      "text": "Remove your stockings, slut! Annie did as instructed. She felt bare... and even more ashamed. Stockings were mandatory at all times for her--only her--at the academy. Sit, stick your leg out, slut! She extended one leg. He pushed, sheathing her leg in new, white latex, fetish thigh-highs. He strained. You pull them up, slut! Your weight makes your thighs fat, you know. She hadn't known. Am I? Am I fat? She looked down trying to see over her fat breasts. Higher... pull. Higher, slut! C'mon. He waited. Now the second leg, slut! You are a stupid bitch. Now stand and let me see. Present yourself, slut. Ohh, were they tight. Annie felt suffocated. It was awkward to move. She felt like she was constantly being squeezed. It made her pussy drip on the floor. I see you like that, slut.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/90026c34-8f92-41a8-8676-12e1b17ae20a/width=525/90026c34-8f92-41a8-8676-12e1b17ae20a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-9"
        }
      ],
      "id": "c5-8"
    },
    "c5-9": {
      "text": "Kneel, slut! He proceeded to place Annie into a wicked contraption, a harness of contorted straps, buckles, and ties. Put your arms back, slut. Her arms were bound, as was her torso. Ow, ohh. It hurt. She could barely breathe.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c68df328-0511-4892-91a8-9b4cbbdd4217/width=525/c68df328-0511-4892-91a8-9b4cbbdd4217.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-10"
        }
      ],
      "id": "c5-9"
    },
    "c5-10": {
      "text": "Each breath was labored and caused her breasts to heave and sway. Kneel and present your tits, slut! Her body was so slippery, when she tried to mount the love-seat, she tumbled into the cushions. C'mon, slut! Are you an uncoordinated bitch as well as a stupid one? With great difficulty and arousal, Annie knelt.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5daa5163-a03b-4980-a308-423d3eb44b45/width=525/5daa5163-a03b-4980-a308-423d3eb44b45.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-11"
        }
      ],
      "id": "c5-10"
    },
    "c5-11": {
      "text": "Stick 'em out, slut. She stuck out her chest. Her huge breasts bounced, and ached. They sloped upward and outward, each adorned with inconceivably huge nipples, flushed, raw, and red with desire. She saw her nipples looked as hard as they felt. She felt ashamed of them. Her body was squeezed tight like her legs. Her arms were pulled back in tension. She felt terribly uncomfortable.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cf7b3afa-346f-44e3-bfb5-0374e6d343d7/width=525/cf7b3afa-346f-44e3-bfb5-0374e6d343d7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-12"
        }
      ],
      "id": "c5-11"
    },
    "c5-12": {
      "text": "It's not that bad, right? It's actually fairly comfortable, isn't it, slut? She nodded. I have more. You will want to try them all, won't you, slut? Her mind was dazed. She was lacking bloodflow and oxygen. She nodded. Present yourself, slut. He withdrew to his desk across the dim, dark office.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/52fc61ff-8575-4e8c-aea2-438562e9264b/width=525/52fc61ff-8575-4e8c-aea2-438562e9264b.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-13"
        }
      ],
      "id": "c5-12"
    },
    "c5-13": {
      "text": "He returned carrying a full leather satchel. He rocked it his hands and it made jingling noises. Annie's mind wondered with fear. He reached in and held up, one in each hand, a pair of metal devices. Her eyes widened. Oh no! No... no. She didn't know what they were, but she shook her head anyway. Yes, slut! You need to feel restraint since you have none.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1aa82b6d-0fbb-44db-ae89-c89c4ec7688c/width=525/1aa82b6d-0fbb-44db-ae89-c89c4ec7688c.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-14"
        }
      ],
      "id": "c5-13"
    },
    "c5-14": {
      "text": "They were a torturous pair of nipple stretchers. Nipple stretchers, slut. We'll go with these first. We still have plenty of time left in this session for others. She stared at them and blinked away tears. He attended to Annie's nipples, and with painful pinching and jerking, he encased them. And then he started turning.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6c1ebde3-b037-4b1f-95a6-c809ba096d81/width=525/6c1ebde3-b037-4b1f-95a6-c809ba096d81.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-15"
        }
      ],
      "id": "c5-14"
    },
    "c5-15": {
      "text": "Ow, ow, ow. Quiet, slut! She grit her teeth and fought back tears. He stretched Annie's nipples until she thought they would tear off. He withdrew to his desk and returned. She peeked and saw another leather bag. Reaching in, he brought out two more devices. He dangled them from his fingers and smirked. We'll try a variety of these. There's more? Nipple clamps, slut. Stick out your tits, slut! He gingerly applied nipple clamps to each breast, further tormenting each nipple.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8721a9ab-d95a-4917-917b-c5b56674d720/width=525/8721a9ab-d95a-4917-917b-c5b56674d720.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-16"
        }
      ],
      "id": "c5-15"
    },
    "c5-16": {
      "text": "Her nipples were on fire. He slowly released a bit, and a bit more, and they pinched. He watched her face express both the involuntary pain and pleasure. Then he released fully. A shock went straight from Annie's nipples, coursing through her core, and exploded upon her clitoris. She panted. It hurts, doesn't it, slut? She nodded with closed eyes.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7bb78eba-9169-4b45-b1f1-7ed98498d579/width=525/7bb78eba-9169-4b45-b1f1-7ed98498d579.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-17"
        }
      ],
      "id": "c5-16"
    },
    "c5-17": {
      "text": "You deserve this pain. It helps you become more aware. Because you are a slut, you will most likely become more aroused as well... but that's your problem. She blinked them back open. She watched in denial as he smirked while pulling two large weights from the bag's side pocket. No. Yes, slut! Now be quiet and watch. Her wide eyes followed the weights. He slowly and carefully routed the hooks on the tips of each weight through loops in the nipple clamps in unison. Look at your tits, slut. She saw her tortured breasts. He was so close that she felt his breath on her breasts. Now look at me in the eyes, slut. And when her glassy eyes met his, he dropped the weights.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/88f63bad-da3f-4548-bd28-ee6c9ebb1c85/width=525/88f63bad-da3f-4548-bd28-ee6c9ebb1c85.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-18"
        }
      ],
      "id": "c5-17"
    },
    "c5-18": {
      "text": "This is what restraint feels like when you're unwilling to restrain yourself, slut. And you can't restrain yourself, can you, slut? She shook her head. Correct, you can't. You're a slut after all. He chuckled. These will be worn during our sessions. They will be a reminder of how slutty you are. The slight discomfort you feel serves to focus your attention on something other than yourself. Restraint will be exercised upon you because you are unable to exercise it yourself. You admitted that, remember, slut? Annie nodded.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2baed214-390f-466f-a799-cdb667d94459/width=525/2baed214-390f-466f-a799-cdb667d94459.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-19"
        }
      ],
      "id": "c5-18"
    },
    "c5-19": {
      "text": "This is how a slut is required to dress. Do you understand, slut? She nodded. Now return to your position and present yourself. Some photos are required to document your restraint. Photographs were taken of Annie in a variety of humiliating poses. He said they were for her file. My my, look at these. You truly are a supreme slut, given as how slutty you look in these. He held up his phone. She shuddered inside. She saw how slutty she was. It sunk in. She was mortified. I hope no one sees those.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c879658d-cc3c-4a88-893e-fe7667e11844/width=525/c879658d-cc3c-4a88-893e-fe7667e11844.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-20"
        }
      ],
      "id": "c5-19"
    },
    "c5-20": {
      "text": "There were many, many more harnesses, stretchers, and clamps throughout his office. For the long remainder of the session, Annie was outfitted with what seemed like all of the possible combinations and permutations. The session felt like it lasted an eternity. Her agonized nipples were outfitted with what looked to be metal monsters. They tortured her. She was taught in depth why she needed each one specifically. Annie almost passed out at times. Snap out of it, slut! And she would return to her pleasure and pain again. Tears would trickle from her eyes.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f760fdaa-50c8-4aad-b360-5e734a79b197/width=525/f760fdaa-50c8-4aad-b360-5e734a79b197.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-21"
        }
      ],
      "id": "c5-20"
    },
    "c5-21": {
      "text": "Stop it! This is for your own good, slut! This is how a slut learns. The discomfort you endure is because you deserve it, and I am a loving disciplinarian. I care enough to give you some restraint. She would be reminded. I deserve it, I suppose. How dirty must I be to deserve this? All she saw were cruel tools of fear and shame. Thank me, slut. She muttered. What was that, slut? She whispered, thank you. I can't hear you. And you should know that you call your superiors, Sir. Thank you, Sir. Finally, Annie found herself again on the couch in one of the most diabolical of restraints. We have a few things to discuss before I release you and you are dismissed.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cdfc0b4b-44b7-4190-bacf-7af49b101ba3/width=525/cdfc0b4b-44b7-4190-bacf-7af49b101ba3.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-22"
        }
      ],
      "id": "c5-21"
    },
    "c5-22": {
      "text": "The term has reached the point of lessons in female anatomy. The female anatomy course, consists of four modules: anatomy, phisiology, psychology, and sexuality. Teaching about the female body and the female mind will occur. Each session consists of the five rotating periods each day. Coursework involves both lectures and labs. Just understand that it will be intensive.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c5365110-26b6-4918-a4e1-a8a0b1bea659/width=525/c5365110-26b6-4918-a4e1-a8a0b1bea659.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-23"
        }
      ],
      "id": "c5-22"
    },
    "c5-23": {
      "text": "I've talked about it with the headmistress. Rather than relying on the old-fashioned diagrams, theoretical situations, and vague terminology, we came up with a better idea. Annie wondered. She was already on full display in front of the academicship during each lecture. Her once-peers had already seen all of her shame. Or so she thought. You are not only a slut, but a selfish slut. That's a fact. You know it, and you've admitted it. A selfish slut is normally refuse to be discarded, and good for nothing. But we decided that you could at least be put to good use. You will gain some suitability. No, please no. What better contribution can a selfish slut make than to give back to those from whom she's taken, from whom she distracts, from whom she wastes their time, and from whose attention she demands.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8efe320f-ad3d-4b13-8696-6a973b9b32ae/width=525/8efe320f-ad3d-4b13-8696-6a973b9b32ae.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-24"
        }
      ],
      "id": "c5-23"
    },
    "c5-24": {
      "text": "It's normal and natural for a slut to be on display. Indeed, you show off your shame to the academy daily. So what better? This is your opportunity to give back. Her body felt tingly all over. Or will you choose to be selfish once again? Answer me, slut. Annie shook her head. Good then. You will serve as our real-life, anatomical model for the female anatomy lectures. Your body will be used as a dim reflection of the wholesome female form, and an ugly representation of normally-beautiful anatomy. You will at least be good for something. And that will be to let your fellow academicship observe, experience and learn from your disgusting mind and worthless body. At least this academy can make you good for something.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/94e771ce-1881-4e8c-aa91-307b360d5bc9/width=525/94e771ce-1881-4e8c-aa91-307b360d5bc9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c5-25"
        }
      ],
      "id": "c5-24"
    },
    "c5-25": {
      "text": "Alright then, slut. Let me release you and get you back ready for your evening shower. Put on your stockings. You will have your normal morning routine tomorrow of your showering, but then report here to me after you've finished your enema and butt plug insertion. I will restrain you and prepare you. You will become a living, educational mannequin. Annie caught her breath. And then it will be off to the first period lecture with you.",
      "next": [
        {
          "text": "",
          "next": "c5-26"
        }
      ],
      "id": "c5-25"
    },
    "c5-26": {
      "text": "Annie was dreading tomorrow. And tonight. She wouldn't sleep. It would be a long and agonizing night.",
      "id": "c5-26",
      "next": [
        {
          "text": "Back to Index",
          "next": "16"
        },
        {
          "text": "Chapter 6 - Annie starts modeling",
          "next": 93
        }
      ]
    },
    "c6-1": {
      "text": "The psychiatrist arrived to an already-full, intimate lecture hall. The hall was a round configuration and dimly lit, except for the center stage. Annie had never been to a hall like this one before. They entered at the rear of the auditorium seating. Many chairs were arranged in a semi-circle surrounding a large cushioned table on the stage.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/8f276f3c-d137-4fc0-963c-794afa56bee0/width=525/8f276f3c-d137-4fc0-963c-794afa56bee0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-2"
        }
      ],
      "id": "c6-1"
    },
    "c6-2": {
      "text": "Steps led down to the center stage. He was escorting a bound Annie into the most intimate of lecture halls by a collar and leash. Two large technicians wearing their usual gray uniform followed behind. She had been prepped this morning, having received her customary enema and butt plug fitting. She had reported to his office after that. He then outfitted her with some of yesterday's tight fetish thigh-highs, tight body harness, and array of nipple stretchers and weighted nipple clamps.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/fccbdd86-d976-4200-aa47-270607373540/width=525/fccbdd86-d976-4200-aa47-270607373540.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-3"
        }
      ],
      "id": "c6-2"
    },
    "c6-3": {
      "text": "Annie walked painfully slow with her enormous butt plug inserted, navigating the numerous steps awkwardly in high heels, each one bouncing her massive breasts and causing her arousing despair. Each labored step down caused her metallic clamps to jingle. Blood flushed into her nipples and pussy. Moving to any degree caused her waves of arousal that she battled back. Everyone stared at the disgraceful procession. She was paraded slowly.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7b789c86-efc5-4ce6-bc07-33bcf2894d28/width=525/7b789c86-efc5-4ce6-bc07-33bcf2894d28.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-4"
        }
      ],
      "id": "c6-3"
    },
    "c6-4": {
      "text": "As she passed the main aisle, with head down, she glanced up with her eyes to see the auditorium seating filled with her once-peers, a couple dozen at least. Most all she did not know. She had no friends at the academy. She had been separated, isolated, and punished from the beginning. Having to sit on display at the front of the halls never gave her opportunity to see the others. But with some of the girls at least she was briefly familiar, mainly after seeing them in the showers or locker room. She had mainly heard them whisper and tease. She blushed from humiliation. She also inadvertently locked eyes with the headmistress and quickly looked away. She noticed a variety of others whom she did not know, officials and superiors in attendance for this inaugural lesson, which included a provost and chancellor. They were seated near the headmistress.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/137d3b0d-60f4-46e6-bdc2-2a71821b9ff3/width=525/137d3b0d-60f4-46e6-bdc2-2a71821b9ff3.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-5"
        }
      ],
      "id": "c6-4"
    },
    "c6-5": {
      "text": "Annie was led up two steps to the well-lit, low center stage. Prior to opening remarks, the psychiatrist began unclamping the metallic manacles biting down, torturing Annie's nipples. She could not contain her feelings, making audible yelps and cries out as her nipples were plucked from the jaws. Chuckles rippled through the audience. Tears welled up.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/ed310938-3310-410a-981c-af510eabd712/width=525/ed310938-3310-410a-981c-af510eabd712.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-6"
        }
      ],
      "id": "c6-5"
    },
    "c6-6": {
      "text": "He then unbuckled the criss-crossing of cinched straps holding Annie's bound body and arms twisted behind her. After some time, she was released her from her leather prison. She looked down at herself. Marks left from where the leather strapping once dug in attested to her prior condition. Her face reddened from embarrassment. The audience would soon not forget. The fetish thigh-highs and towering high heels remained. He retied her arms and elbows tightly behind her back, which only served to unsubtly heave her breasts outward and upward. Muttering resonated amongst the seated academicship.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c0fad1f5-3135-485f-a119-8de29adb5ef4/width=525/c0fad1f5-3135-485f-a119-8de29adb5ef4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-7"
        }
      ],
      "id": "c6-6"
    },
    "c6-7": {
      "text": "The psychiatrist withdrew, speaking softly with both technicians. He returned and came close to Annie's ear and whispered. On your knees, slut. She looked up at him, confusion spreading across her face. How am I going to kneel in high heels with my arms tied behind me? As if reading her mind, she felt him lift on the ropes behind her, allowing her to go to her knees without a terrible fall. You're welcome, slut. He continued whispering as if with an unruly child. Turn around, slut. C'mon, ass out, present yourself to the audience. She wobbled on her knees, breasts swaying dramatically. She turned herself around. Knees apart, slut. They saw her glittering jewel illuminated pristinely by the stage lights.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2c4712e2-eacd-4a61-9319-0d9e4fbd8b8f/width=525/2c4712e2-eacd-4a61-9319-0d9e4fbd8b8f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-8"
        }
      ],
      "id": "c6-7"
    },
    "c6-8": {
      "text": "He motioned the technicians over. And with that, one began massaging and digitally lubricating Annie's asshole with their fingers. Annie felt mortified. Oh, no, no, no. They were preparing Annie for the embarrassment of her butt plug removal in full view of the audience. This had, at all times prior, been done in the privacy of one of the health exam rooms. Normally, she only had the embarrassment of the process of being alone with the few health monitors and technicians administering her butt plug discipline. Now it was happening here, with all to see. After wiping the bejeweled end with a clean, white cloth, the massive hand of the second technician latched down on the glistening jewel. Annie felt like she was having the biggest bowel movement ever... in public!",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/aa65a6e0-54bd-436c-a880-00ecc25993d9/width=525/aa65a6e0-54bd-436c-a880-00ecc25993d9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-9"
        }
      ],
      "id": "c6-8"
    },
    "c6-9": {
      "text": "She felt an intense stimulation, an intense energy being applied to her rectum. And with a slow and steady twist and pull, the shining silver beast was gradually extracted. Annie let out a loud and sustained moan. The crowd erupted into snickering, muttering and pointing. Annie was sickened with shame. The second application of soothing balm was reapplied to the inside and outside of her pulsing asshole by the first technician's fingers. But the humiliation had only just started.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/df84db8c-3313-49e6-b93e-49affdb3898d/width=525/df84db8c-3313-49e6-b93e-49affdb3898d.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-10"
        }
      ],
      "id": "c6-9"
    },
    "c6-10": {
      "text": "The psychiatrist walked toward the edge of the stage nearest the headmistress and began his opening remarks. The audience hushed. As you know, we are now starting lessons in human female anatomy. More whispers and chuckles could be heard amongst the small auditorium seating. Settle down now, please. We have made these arrangements for up-close, intimate seating so the academicship can more closely observe and interact with today's subject material.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/f4c2ee6a-bffc-4c2a-a5e7-abc58f50ff10/width=525/f4c2ee6a-bffc-4c2a-a5e7-abc58f50ff10.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-11"
        }
      ],
      "id": "c6-10"
    },
    "c6-11": {
      "text": "For your education, and for hers, the academy has graciously offered us use of their problem delinquent. You all may know her as, Annie. In my professional judgement in working with her these past couple of days, I have made the determination that she is in fact a slut. Subtle but raucous giggling arose, then quickly quieted as to avoid missing a word.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1f5e6482-3ede-4bb2-b617-fce6f832c507/width=525/1f5e6482-3ede-4bb2-b617-fce6f832c507.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-12"
        }
      ],
      "id": "c6-11"
    },
    "c6-12": {
      "text": "You are aware of her behavior these past few weeks, from the beginning of the term, since her first day with us. Let me begin by apologizing to you, on behalf of the academy, to those we have been charged with educating, for the distraction her presence has caused. We hope to make this up to you by giving you this opportunity for you to have your reprisal upon this one who has caused you so much distraction, discomfort and distress.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0f9b8fbf-9499-4cb9-aee7-91d2c8edbdf2/width=525/0f9b8fbf-9499-4cb9-aee7-91d2c8edbdf2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-13"
        }
      ],
      "id": "c6-12"
    },
    "c6-13": {
      "text": "He glanced back at Annie. He continued in a clinical tone. You all will learn many technical terms throughout the course, but when speaking of our subject slut, I will instead use the obscene alternatives. So please pardon my vulgarity, and thank you for understanding. Everyone understood. They all knew Annie, and most had wondered if she was a slut. Now, their suspicions had been confirmed.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/57d1ac5d-56be-497c-ae55-6e65ea07df64/width=525/57d1ac5d-56be-497c-ae55-6e65ea07df64.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-14"
        }
      ],
      "id": "c6-13"
    },
    "c6-14": {
      "text": "My assessment is as follows: Per usual, as you can see, our subject slut is displaying obvious signs of massive arousal, namely--this is going to be a quite long but not exhaustive list--the throbbing asshole clenching around her butt plug--well, her prior butt plug. More snickering resounded. He continued. The absolutely wet pussy, the expansion and tightness of the voluminous tits, the rock-hard nipples, the swollen pussy lips, the flushed pussy flaps, the dripping of pussy juices, the slickness of the pussy mound, the recession of the pussy hood, the engorgement of the protruding clit, the seductive whimpers, the labored yet heavy breathing, the blushing of the cheeks, the reddened enlarged lips of her face, and the glossy, perspiring skin. You all will be instructed about these phenomena and her anatomy.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/32e30fa6-2b36-499f-aabf-0ae9bfd1abb3/width=525/32e30fa6-2b36-499f-aabf-0ae9bfd1abb3.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-15"
        }
      ],
      "id": "c6-14"
    },
    "c6-15": {
      "text": "Each session over the coming weeks will consist of four modules: anatomy, phisiology, psychology, and sexuality. Each module will be explored in depth with our subject slut over the course of the term. Realize that she will be learning along with you, albeit from a different perspective. But she will be experiencing the same teaching, and receiving the same instruction--only more directly. This academy cares so much about our subject slut as to never give up on her discipline and education.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/34976897-e3c0-4855-8c02-dc8f70cab3f3/width=525/34976897-e3c0-4855-8c02-dc8f70cab3f3.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-16"
        }
      ],
      "id": "c6-15"
    },
    "c6-16": {
      "text": "This week's instruction and observation will be followed up by next week's testing. You will have opportunity to experiment on our subject slut, to test arousal stimuli and identify arousal effects. We will review your findings, test your hypotheses, and evaluate them in subsequent lectures. We encourage you to take pictures and video of our subject slut and her anatomy. Use them to review the anatomy in your study groups and document your theories. Make sure you present written as well as visual hypotheses.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/565e43b9-db52-4b0a-abab-7c784cf5ee0f/width=525/565e43b9-db52-4b0a-abab-7c784cf5ee0f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-17"
        }
      ],
      "id": "c6-16"
    },
    "c6-17": {
      "text": "Many of you are learning about the female human anatomy for the first time. Boys, you will have never seen, sensed, nor touched a slut before, let alone been familiarized with a female in the depth you will experience in these sessions. Girls, while having these parts, you are wholesome and so will also not have familiarized yourselves with your own bodies and genitalia, or what fierce arousal may look like. You have common decency. But you will learn the potential risks of becoming a slut such as this one.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d9dfe178-b097-45e3-93c0-b184384c5ad4/width=525/d9dfe178-b097-45e3-93c0-b184384c5ad4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-18"
        }
      ],
      "id": "c6-17"
    },
    "c6-18": {
      "text": "I understand that our subject slut has made you all feel the discomfort of seeing her disgusting arousal in these halls. So, all of you, use this as your opportunity to explore and experience, without fear or embarrassment. Become familiar with the female body and process of female arousal. Please, experiment on her freely, with no guilt or condemnation. Explore your educational and sexual curiosities on our subject slut without fear of humiliation. This is your opportunity to learn how your own bodies function. We will not judge you. We are aware of your wholesomeness. We know you will approach these lessons with honest curiosity, genuine compassion and educational eagerness.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0b462a68-47b5-4d32-aa5b-c860c3c8ca8f/width=525/0b462a68-47b5-4d32-aa5b-c860c3c8ca8f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-19"
        }
      ],
      "id": "c6-18"
    },
    "c6-19": {
      "text": "With that being said, there is to be no intercourse... I'm looking at you, boys. And of course, except for that limitation, feel free to use all your senses with academic vigor. See, feel, smell, listen, and taste. You should understand that education and examination demands all five of our senses. We have provided you this array of sex toys and dildos for the more clinical and civilized approach to stimuli. Annie looked up at the table in front of her and saw a dizzying collections of artificial penises, butt plugs, vibrators, pumps, probes, clamps, beads, and other assorted devices that looked more like laboratory equipment crawling with electronic wires. Her eyes downcast, as did her countenance. How will I stand this? This is going to be dreadful. I'm in a nightmare. Or am I?",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/289774cd-2b68-4dd2-896a-79674d4092b7/width=525/289774cd-2b68-4dd2-896a-79674d4092b7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-20"
        }
      ],
      "id": "c6-19"
    },
    "c6-20": {
      "text": "You will learn about the psychology of a slut. A slut sees herself as a playtoy, a sex doll so to speak, so this is how she must be treated. Such treatment is in order to demean and discipline her, and bring awareness to her dispicable behavior. You will have plenty of time at the end of each session to experiment.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c15ff755-9912-42c5-8553-449bf42c76f7/width=525/c15ff755-9912-42c5-8553-449bf42c76f7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-21"
        }
      ],
      "id": "c6-20"
    },
    "c6-21": {
      "text": "You will be allowed to push the desire limits our subject slut. You shall take her up to the edge of those limits, but most importantly, never over. A slut's arousal should never be granted fruition. This is part of her punishment. We have taken great care to avoid cruelty in pushing her over the edge of shame. We are civilized after all. You should be advised to also treat her with respect by denying her any embarrassing release. Although she does not deserve your respect, she does at least deserve your merciless attention to her denial.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/2bda121e-c478-4099-8648-899ab3b14019/width=525/2bda121e-c478-4099-8648-899ab3b14019.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-22"
        }
      ],
      "id": "c6-21"
    },
    "c6-22": {
      "text": "Because she is so tightly bound and unable to sustain posture, these men will be handling our subject slut during sessions like a slab of meat, arranging her into the various positions and the slutty poses most suitable for viewing her body parts and arousal responses. With group concensus, and as your educational needs require, you will be able to direct them to handle her. There will be no moving her yourselves.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/cf89d7e4-91cb-432c-9bb4-c4d932394325/width=525/cf89d7e4-91cb-432c-9bb4-c4d932394325.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-23"
        }
      ],
      "id": "c6-22"
    },
    "c6-23": {
      "text": "Alright people, divide into groups of six. Move from your seats there and come to the stage. The academicship clamored in a rush. Slowly now, people. Only six at the table at a time! You will all get a chance up here. Settle down. Others sit here. Move your chairs in close. Annie was frightfully ashamed, degraded, crushed... and yet, formidably aroused as she was man-handled, picked up and placed on the center table... just like a slab of meat.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/caefd4ff-1e20-47a1-8d65-1f369af3904e/width=525/caefd4ff-1e20-47a1-8d65-1f369af3904e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-24"
        }
      ],
      "id": "c6-23"
    },
    "c6-24": {
      "text": "The first period of the first session of the first day was just starting. The man stopped before leaving the stage, and whispered in Annie's ear. You've done well here so far, slut. I have a feeling you may find yourself enjoying it. If you keep it up, after your four years at the academy, we may want to keep you on for future enrollees.",
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/76f66f21-c845-40ec-8481-6c9834dcf6b4/width=525/76f66f21-c845-40ec-8481-6c9834dcf6b4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "c6-25"
        }
      ],
      "id": "c6-24"
    },
    "c6-25": {
      "text": "Annie closed her eyes and took a deep breath.",
      "next": [
        {
          "text": "",
          "next": "c6-26"
        }
      ],
      "id": "c6-25"
    },
    "c6-26": {
      "text": "Note from [the author](https://civitai.com/user/egoform):\n\nThank you for reading this story from my twisted mind. I hope you liked it. Visit my posts to see all the attempts at Annie, particularly ones related to this story. Be sure to give me feedback and comments. I'd like to hear what you think. And I could use the buzz to continue making more images with stories.",
      "id": "c6-26",
      "next": [
        {
          "text": "Back to Index",
          "next": "16"
        }
      ]
    }
  }
}