{
  "meta": {
    "title": "Annies Story",
    "author": {
      "name": "egoform",
      "url": "https://civitai.com/user/egoform"
    },
    "year": "2025"
  },
  "state": {
    "current_section": "16"
  },
  "sections": {
    "1": {
      "text_lines": [
        "Annie, albeit somewhat of a tomboy, started as a normal, nice, petite, demoiselle. However, at age she was already self-conscious even before becoming aware of her changing body, pubic hair, budding breasts and sensitive nipples. But until academy, she had always done well to ignore her forthcoming womanly body. She was dropped off at the intensive boarding academy with little but the clothes she was wearing and her backpack full of supplies."
      ],
      "id": "1",
      "media": {
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/73f46107-5af1-48c2-bfc4-6b5ce916e44d/width=525/73f46107-5af1-48c2-bfc4-6b5ce916e44d.jpeg",
        "type": "image"
      },
      "next": [
        {
          "text": "",
          "next": 2
        }
      ]
    },
    "2": {
      "id": "2",
      "text_lines": [
        "On her first day, she was told lessons begin at once. She was immediately instructed to report for a health and hygiene check, and that this was a vital part of her instruction. Washing and bathing are to be performed daily. Annie was usually disheveled and messy, but that sounded reasonable. She was made to take all of her clothes off. She had hated being naked. The check felt so embarrassing. She was notified that she paid too little attention to her hygiene and that she must stop her obviously lustful thoughts. Education requires both a clean body and clean mind. She was told it was apparent that she had neither. A high degree of concern was shown regarding her pubic hair and nipples. It was true. She had never paid them much attention. But now, they were brought to the forefront of her mind because they were highlighted as a problem. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4116b13b-1843-44aa-b773-a81096e63325/width=525/4116b13b-1843-44aa-b773-a81096e63325.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 6
        }
      ]
    },
    "3": {
      "id": "3",
      "text_lines": [
        "Next, Annie was instructed to report for her uniform fitting. The uniform would follow her throughout her time at academy. She should take great care of it. She would be happy to. She looked forward to it. At least she would have a uniform like the others she saw walking the hallways, allowing her to conceal her body and her particular problem areas. She was mortified that the process again required disrobing. A clipboard was intently studied, notes reviewed. Prolonged gazes studied her nakedness, switched to the clipboard and back repeatedly. To her dismay, this took some time, which did not help her avoid the swelling and moistening of her pussy, and arousal and erection of her nipples. She knew she was to avoid this and yet she failed again already. She tried to push the awareness of the coolness she felt on her body out of her mind. But she found that only reinforced her arousal. "
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/aaf20e72-c70b-45b5-b414-bd533ee253b2/width=525/aaf20e72-c70b-45b5-b414-bd533ee253b2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 17
        }
      ]
    },
    "4": {
      "id": "4",
      "text_lines": [
        "Thigh-high stockings must be worn at all times. Had the other girls she'd seen been wearing stockings? She recalled not. They were allowed to wear shorts under their skirts. But maybe they didn't struggle with a dirty mind and body like herself. She lamented and nodded her understanding. To her dismay, she was fitted with a quite tiny uniform. Wearing the skirt, it felt short, and she was quite certain her butt cheeks were hanging out and her pussy barely covered. She felt exposed. It felt drafty between her legs. Why was the skirt so small? Why did her uniform look so much smaller compared to the common style? How would she be able to face the staff, faculty and academicship? She worried the jacket and shirt were too short, small and tight already. It was difficult to button the too-few buttons. She realized her breasts had been growing continuously and feared how badly this uniform would fit should her unspoken fears come to pass. Hopefully, they wouldn't grow much. She could always hope. She now looked in the giant mirror into which she had previously avoided looking. Pleading meekly for a different uniform only resulted in quite stern reprimands. She tried to blink away tears. How she had hoped she could blend in and hide having a uniform! That would not be the case."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5/width=525/4e6ae78d-4c8a-40fc-abe1-b161378f5fd5.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 5
        }
      ]
    },
    "5": {
      "id": "5",
      "text_lines": [
        "As the academic year proceeded, Annie's hair grew, as did her breasts... and as did her arousal. Her nipples were always hard and erect. The slightest movement, let alone walking, caused her now ample breasts to sway. Below the thin fabric of her shirt, they bounced. She felt them. And her nipples responded dutifully. Her struggles only worsened. So much so that it became necessary for any staff and faculty to perform random health checks on Annie. It could happen at any time or place. Male or female, they checked. It needed to be done. At first, they would be somewhat private and discrete. Later, not so much."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5a46821c-f875-442f-813d-ecc509b30e99/original=true,quality=90/c227c59f-5f32-44b7-8262-587ff620fb39_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 7
        }
      ]
    },
    "6": {
      "id": "6",
      "text_lines": [
        "Her pubic hair was trimmed and shaved up above her pussy to expose her now smooth and shiny vulva. It was to be kept shaved as such daily. This would promote cleanliness and health, as well as making periodic health checks easier. As far as her nipples, she must be always aware of her arousal, their state, strive to keep them unerect, and should they become erect, work to avoid focusing on them so as to reduce their sensitivity. They were obviously a sign of an unclean mind. This heightened concern only made Annie even more self-conscious. Now, after the humiliation and obvious failure on her first day, it seemed this was all she could think about."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d1034cb1-0ed4-4847-9366-1369e4e63276/original=true,quality=90/6b0c9674-fa22-4258-b5a6-f234d80a211a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "3"
        }
      ]
    },
    "7": {
      "id": "7",
      "text_lines": [
        "They demanded she expose her breasts. And if not completely erect initially, her exposure and vulnerability then made her nipples snap to aching attention. Never did a check find Annie in compliance. They demanded her to drop her panties. She failed miserably over and over. Fully nude, nothing helped. Panty privilege was lost to required thongs. Thong privilege was lost to required bare skin in order to alleviate those nagging, moist desires between her legs. Nothing helped. Her nipples gave her state away. Her glossy, wet pussy betrayed her obsessions. She was haunted by her exposure. Her exposure fed her arousal. Her arousal fueled feelings inside her body. Every day was a tortured spiral down into even more exposure, more arousal, more desire."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b0796f57-7d63-41f6-a947-37dbca1296ac/width=525/b0796f57-7d63-41f6-a947-37dbca1296ac.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 8
        }
      ]
    },
    "8": {
      "id": "8",
      "text_lines": [
        "The headmistress was informed. She kept constant tabs on Annie. The decision was made to assign her the desk at the front of the lecture hall, set off by herself, alone, so she would not be influenced, nor tempted to hide her conditions amongst the others. She was placed at her desk in full display. All eyes were upon her. She could not hide. She was terribly embarrassed. Is everyone looking at me and my body? They are. I just know they are. My boobs are so full, so tender and so sensitive. My pussy feels like it's so slick and throbbing. I bet everyone sees that. I bet my nipples are super hard. Yep, they are. Everyone is looking at them. Why did she have these struggles? Why was she so filthy? Was she beyond help? It seemed so. These were her unceasing thoughts. Her attention was lost. And her academic marks suffered."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/af3a3d0e-f3da-48ac-bb15-a4c3c071ec38/original=true,quality=90/15485c0d-ab63-4a69-82bb-8228a9487924_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 9
        }
      ]
    },
    "9": {
      "id": "9",
      "text_lines": [
        "The headmistress issued orders to all staff and faculty to focus more on Annie, and to step up health checks. Educators were reminded to keep pressing her. Some demanded that Annie stand at the front of the hall. Some insisted that she remove her jacket in full display of the academicship. Others commanded her to remove her thong as an exhibition. She obliged. She could not think straight. She felt broken. Some days, she felt like she was out of her uniform more than in it."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4108d4a0-0bbd-4779-a17c-db850b7bdd97/original=true,quality=90/f4479bfd-28e2-4de6-ad52-5e4e25029ac9_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 10
        }
      ]
    },
    "10": {
      "id": "10",
      "text_lines": [
        "Every day, and in every session, Annie was called upon by educators. She was required to stand up from her chair in order to attempt to answer the frequent questions. She hadn't even heard the question. All she heard were the thoughts in her head. And the feelings. Those feelings in her body. She must try harder."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/25961813-f283-4bac-9a07-aa957515d23c/original=true,quality=90/c5e95776-306a-43c7-b02f-6609445a0ca3_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 11
        }
      ]
    },
    "11": {
      "id": "11",
      "text_lines": [
        "Annie was made to stand up front, shamefully making feeble attempts at writing work on the huge blackboard. The assignment was always written on the top of the board, and the board moved up high. This caused her to have to reach with arms raised and on her toes. Her skirt lifted to around her waist. At least one breast never failed to bounce out under the lifted shirt. She was not allowed to cover or conceal her shame. She just fought off the anguish. Nevertheless, this made her so humiliated. She felt like she, and her arousal, were on full display. They were."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/07f87935-e16e-42a0-847a-77e940b3cc14/original=true,quality=90/400e7b84-c4ae-4557-9b3a-bd2f01d8839e_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 12
        }
      ]
    },
    "12": {
      "id": "12",
      "text_lines": [
        "Other educators would sit in and try to help Annie. But didn't they know that simply made her even more of the focal point. It didn't feel like they were helping. At times, Annie was made to attend with her shirt raised, or her shirt opened. The concensus was that if Annie was showcased enough, then they may be able to salvage her. Well, maybe not Annie, but maybe others. She was a lost cause."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/bbe7e590-8ff1-4f90-89fe-1bbde51d75d2/original=true,quality=90/bd265fe6-c733-45c8-a6e3-6f72a71cd456_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 13
        }
      ]
    },
    "13": {
      "id": "13",
      "text_lines": [
        "Annie's supposed coequals treated her as inferior. And she was. She knew she was. She couldn't pretend that their pointing, stares, giggles, and whispers went unnoticed. All it took was a little teasing and her pussy would start dripping. It was obvious. She was mortified. Those in the hallways or locker rooms always seemed to not-so-accidentally brush against her breasts, or brush against her ass. Some grabbed, others groped, girls tickled, all in an apparent attempt to cause a swift and thorough health check from their superiors. Health checks became essentially public, and in full display. No matter how hard Annie tried, she failed."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a0b3160e-f46e-4674-99ad-5863052b64ff/original=true,quality=90/1d05c4cb-62fc-40d8-b7f1-ec2483b8229a_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 14
        }
      ]
    },
    "14": {
      "id": "14",
      "text_lines": [
        "Annie had just started her first year at academy. She was horny. She could no longer deny it. And the year was only just beginning..."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0a8c246d-ef5b-49fb-8cc6-1b78e3fb58b6/original=true,quality=90/911bed89-79c5-49b3-9aa0-0794dec3c36d_a1111.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 15
        }
      ]
    },
    "15": {
      "id": "15",
      "text_lines": [
        "# Chapter 2",
        "## Annie's worsening"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9a120e5f-3fba-4e6f-8ecb-6d3c3d82fc85/width=1320/45.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 18
        }
      ]
    },
    "16": {
      "id": "16",
      "text_lines": [
        "# Chapter 1",
        "## Annie's time at the higher academy",
        "",
        "The original story is by [egoform](https://civitai.com/user/egoform) to be found on [civitai](https://civitai.com/articles/10803/annies-time-at-the-higher-academy)."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4378078a-619b-40e9-b7ec-5bb1fbf4fecd/original=true,quality=90/54634320.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": "1"
        }
      ]
    },
    "17": {
      "id": "17",
      "text_lines": [
        "Measurements were taken in full nakedness and in a variety of positions. Photos were taken. Due to her obvious failures with arousal, she was notified that she would not be issued a bra. One would only press in on her breasts and rub coursely on her nipples, causing them to become erect. Besides she was told, she was not aged, her breasts were still firm and not too large yet. They did not sag, so she really didn't need one. She mentally resigned, knowing she could use any help avoiding arousal of her nipples. While allowed, she was encouraged that panties likewise should be kept to a minimum and as needed. Small panties or thongs would be permitted as a privilege. Any problems with arousal would cause the immediate removal of that privilege. Problems down there will necessitate not wearing any as to avoid her awareness of lace rubbing on her pussy. She needed to be careful. "
      ],
      "next": [
        {
          "text": "",
          "next": "4"
        }
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c6e90fbe-1cb9-4da9-86d5-5d2595ec8e6c/original=true,quality=90/90590e5d-11a7-4af3-af59-26de0fdaf589_a1111.jpeg"
      }
    },
    "18": {
      "id": "18",
      "text_lines": [
        "As the academic year advanced on, so did the efforts to make Annie aware of her condition. Her hair continued to grow, but so also did her breasts... not to mention her burning desires. Annie had an unclean mind and an unclean body. It had been made known to her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/03de3aaa-76b8-4724-a58b-3bec66a7a8d0/width=525/03de3aaa-76b8-4724-a58b-3bec66a7a8d0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 19
        }
      ]
    },
    "19": {
      "id": "19",
      "text_lines": [
        "She needed to be reminded of the disappointment. Her failures needed to be made public. Learning was the objective. And learning demands a clean mind and body"
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/c076a356-aa1e-4e08-998b-11fa315bbc24/width=525/c076a356-aa1e-4e08-998b-11fa315bbc24.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 20
        }
      ]
    },
    "20": {
      "id": "20",
      "text_lines": [
        "Annie's obsession with her dirty mind and body only intensified. She struggled constantly with her sensitive, erect nipples and her swollen, wet pussy. Beyond that, she struggled with the intense desires and nagging feelings deep inside her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/9eca7ea3-f777-4d71-af8b-7bd0190725d2/width=525/9eca7ea3-f777-4d71-af8b-7bd0190725d2.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 21
        }
      ]
    },
    "21": {
      "id": "21",
      "text_lines": [
        "It was imperative that Annie be aware of her arousal. Her problems with arousal were always noticed and emphasized, her body always highlighted, always on display. She needed that if she was to regain any control. And this higher academy demanded control. Humiliation was part of the process. If there was any hope for Annie, awareness was necessary. Control was necessary."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e03ab9c8-3883-4b33-b1a1-e4b1eb151b04/width=525/e03ab9c8-3883-4b33-b1a1-e4b1eb151b04.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 22
        }
      ]
    },
    "22": {
      "id": "22",
      "text_lines": [
        "She was made an exhibit. Her failures were on center stage. She was paraded throughout the day, and that was by intention. Day by day, she would be exposed and humiliated. And day by day, she would fail."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3b3b5dd9-5673-4856-9a21-b82d63b19391/width=525/3b3b5dd9-5673-4856-9a21-b82d63b19391.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 23
        }
      ]
    },
    "23": {
      "id": "23",
      "text_lines": [
        "Annie may indeed be lost, but using her as an object lesson was the next best outcome. Then at least others can learn from her inadequacies. Firsthand learning at the expense of Annie's dignity would be worth it. The academy would not let Annie stand in the way of learning, even if she was unable."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/920262f8-717b-4bd9-8a68-7cda1fe31eb0/width=525/920262f8-717b-4bd9-8a68-7cda1fe31eb0.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 24
        }
      ]
    },
    "24": {
      "id": "24",
      "text_lines": [
        "The health checks were now more and more frequent, often occurring between every lecture, and occasionally during one--at the front of the auditorium. Meticulous tabs were kept on Annie. Notes were recorded. Photos were taken. Arousal levels were measured. That required more groping and fondling than a typical health check. And by more than one of the staff."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/222835c8-1b76-4f30-ab44-311801c14b42/width=525/222835c8-1b76-4f30-ab44-311801c14b42.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 25
        }
      ]
    },
    "25": {
      "id": "25",
      "text_lines": [
        "Her arousal had become so rampant that it had spread throughout many other parts of her body. The slightest breath near her ear, the slightest tug on her hair, the slightest caress of her skin, the most gentle poking of her rectum. These all set her off. And Annie could not hide it. Oh, how she tried to hide it. It was no use. Concealing her arousal was nonexistent. She felt dejected."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/0b3fd4a5-0cef-4155-89e0-5bd7e1810dd4/width=525/0b3fd4a5-0cef-4155-89e0-5bd7e1810dd4.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 26
        }
      ]
    },
    "26": {
      "id": "26",
      "text_lines": [
        "None of the other girls needed near the amount of attention the staff and faculty paid Annie. Her mind was in perpetual knots. She couldn't think straight. But it was made apparent that she was different. She knew that. The other girls don't seem to have my same problems. My nipples are constantly aroused. I feel them hard all the time."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3ca6f255-3e6f-4b2a-96f0-6b0cd14fe96e/width=525/3ca6f255-3e6f-4b2a-96f0-6b0cd14fe96e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 27
        }
      ]
    },
    "27": {
      "id": "27",
      "text_lines": [
        "I so want to touch another girl, to see what she feels like. Is her body so different than mine? Stop it! What's wrong with me? I lost my panty privilege because I'm so horny. My thoughts aren't helping. Don't I care that everyone can see my wet pussy? I'm sure they realize what I'm thinking. My body makes it obvious."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/931250a2-3862-4821-a216-f6e35f27447e/width=525/931250a2-3862-4821-a216-f6e35f27447e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 28
        }
      ]
    },
    "28": {
      "id": "28",
      "text_lines": [
        "Annie was ashamed. Annie knew she was hopeless. But she also knew she deserved this. It's my fault. If I could control myself and control my thoughts, I wouldn't need this. I wish I could be like the other girls. I wish I had a clean mind and body."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/b84736c5-deca-4ec1-b5ce-4af8431103bf/width=525/b84736c5-deca-4ec1-b5ce-4af8431103bf.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 29
        }
      ]
    },
    "29": {
      "id": "29",
      "text_lines": [
        "She had always been teased, even by the staff and faculty. The academicship pointed and whispered and tickled, as a game, as entertainment, all in an effort to expose her arousal, which in turn required attention from a superior, likely demanding disrobing, being made an object lesson, or a health check... or all of the above. When ever and where ever. They found it funny."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/14ca9d5b-7320-406b-8bb4-61401de82756/width=525/14ca9d5b-7320-406b-8bb4-61401de82756.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 30
        }
      ]
    },
    "30": {
      "id": "30",
      "text_lines": [
        "They knew it revealed how bad Annie is. She can't control how horny she is. Annie heard some of the whispers. Look, look how horny Annie is today. It's even worse than yesterday. I bet she's a slut. Annie heard it all, but she kept quiet."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e2307fff-3801-4bf1-8e28-7c5bcb4e13de/width=525/e2307fff-3801-4bf1-8e28-7c5bcb4e13de.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 31
        }
      ]
    },
    "31": {
      "id": "31",
      "text_lines": [
        "She didn't say anything. She knew it must be true. I am. So she kept to herself. She tried in vain to not focus on her dirty mind and body. She failed. It's not possible for me to have friends. No one wants a friend like me, someone so awful."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/70a7d692-90f2-4d51-8272-f84fb7d8d3c7/width=525/70a7d692-90f2-4d51-8272-f84fb7d8d3c7.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 32
        }
      ]
    },
    "32": {
      "id": "32",
      "text_lines": [
        "Annie almost had her big mistake, and that quite by accident. Daily hygiene requirements included her shaving her pussy. It was to be kept smooth. Razors were an obligatory part of the provisions issued by the academy. It was for health reasons. You know, staying clean and dry down there. And although Annie's pussy was rarely dry, at least she tried by keeping her pubic hair shaved up."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/706a33f7-a5ce-412e-8d9f-e964bf2e5eb8/width=525/706a33f7-a5ce-412e-8d9f-e964bf2e5eb8.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 33
        }
      ]
    },
    "33": {
      "id": "33",
      "text_lines": [
        "Staying smooth was part of the health check. Like most of the health check, it wasn't uncommon for her to fail in this regard and be taken to the showers and shave again, and shave better, with a new razor. It was only one of many of Annie's failures: not staying smooth enough. I just can't seem to do anything right. I'm worthless."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/80d2c8bb-86e2-4928-8721-7e343eead10e/width=525/80d2c8bb-86e2-4928-8721-7e343eead10e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 34
        }
      ]
    },
    "34": {
      "id": "34",
      "text_lines": [
        "In the locker room, she started noticing. That's when she noticed them noticing her. Of course, everybody did. She sat in front of them. She was made to stand in front of them to answer questions. She was made to work on the blackboard at the front of the lecture hall. She was made a spectacle. Normally, she avoided eye contact. Eye contact doesn't help her ever-alert nipples and pussy."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1206f180-557f-455d-b931-ede6fbb4d8e6/width=525/1206f180-557f-455d-b931-ede6fbb4d8e6.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 35
        }
      ]
    },
    "35": {
      "id": "35",
      "text_lines": [
        "In the showers, she tried to conceal her shame. But the shower was communal. There was nowhere to hide. She sought out the corner shower. But often they were taken. So she would endure the stares."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/abd48bab-70fe-486e-a2c8-5ef5b8cbbb60/width=525/abd48bab-70fe-486e-a2c8-5ef5b8cbbb60.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 36
        }
      ]
    },
    "36": {
      "id": "36",
      "text_lines": [
        "She relented to knowing the soapy water would only make her nipples even more rabid. Washing, even with the slightest touch of her own hand, sent tingles to the furthest reaches of her core. With eyes down, she would be aware of the other girls. But there was a health monitor ever-present, only watching her."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/4cec7aa2-363f-489f-8a8a-a8d0446745a9/width=525/4cec7aa2-363f-489f-8a8a-a8d0446745a9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 37
        }
      ]
    },
    "37": {
      "id": "37",
      "text_lines": [
        "The female monitor normally paid no regard to the others. It seemed only Annie was monitored. Annie started to feel envious, envious of the other girls. They weren't monitored like me. They were friends. They whispered together in the shower. They laughed. They had nothing to be embarrassed of."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/43b2d9ac-a3b7-40bc-8ba3-522d26a053be/width=525/43b2d9ac-a3b7-40bc-8ba3-522d26a053be.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 38
        }
      ]
    },
    "38": {
      "id": "38",
      "text_lines": [
        "Her thoughts, feelings and emotions were such a tangled mess that she didn't actually know that she was envious. But she was."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d9e9cc92-aac4-45a1-87ee-661c8d039a48/width=525/d9e9cc92-aac4-45a1-87ee-661c8d039a48.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 39
        }
      ]
    },
    "39": {
      "id": "39",
      "text_lines": [
        "Normally, Annie touches her pussy and breasts only out of the utmost necessity. Even then, she does try. She does at least try to avoid worsening her already soaring arousal. Whatever sensation or touch just seems to set her off. Walking, moving, even sleeping... you name it, drives her to insanity."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7e217333-49cf-411b-a87d-8238b6c955ab/width=525/7e217333-49cf-411b-a87d-8238b6c955ab.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 40
        }
      ]
    },
    "40": {
      "id": "40",
      "text_lines": [
        "This is what make her forced exhibition and health checks so maddening. Touch and attention prove to send her over the edge. And her academyship know it. They exploit it. Everyone seems to know it. It takes all she has to hold back her urges, feelings, and desires. Yet she does."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d40c4ccd-753c-4f19-b57d-d2db7b85790f/width=525/d40c4ccd-753c-4f19-b57d-d2db7b85790f.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 41
        }
      ]
    },
    "41": {
      "id": "41",
      "text_lines": [
        "It was during one of these required and monitored re-shavings that it happened. No matter how gently Annie held her sensitive tummy, pressed, and agonizingly glided the razor, she felt the movement across her vulva. My pussy... The soapy sudsy water flowing down, across her breasts, falling onto her belly, and tapping on her dirty spot. (She didn't know the name of it yet. They hadn't gotten to those parts of the lectures.) As she brought back the razor stroke in an inadvertent disregard, her wrist and razor handle touched on the sensitive spot."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/d0a09e4e-2d83-4111-8360-0cda9811f878/width=525/d0a09e4e-2d83-4111-8360-0cda9811f878.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 42
        }
      ]
    },
    "42": {
      "id": "42",
      "text_lines": [
        "She jolted. The razor fell, and she slid her fingers down almost by accident. She pressed into her pussy. But she realized that the monitor was watching. She went tense. Her tummy muscles tightened. Oh no, oh no. What is happening? She saw scribbling on the clipboard. Fight it, fight it. The monitor peered more closely over her glasses. But Annie fought, and breathed, and closed her eyes. She was able to push that seemingly unstoppable eruption down. She did not want to be dirty. Annie's first orgasm--if you can call it that--was a flickering, mocking, ruined orgasm. Her first orgasm was almost in the shower shaving, in full inspection of one of the monitors."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/e3d28702-67b5-471b-9d16-4cf990b8bc28/width=525/e3d28702-67b5-471b-9d16-4cf990b8bc28.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 43
        }
      ]
    },
    "43": {
      "id": "43",
      "text_lines": [
        "Whether warranted or not, the monitors' alerts always made it back to the headmistress soon enough. Annie is irreparable. She's a lost cause, and we need to take action. We know this because Annie's arousal has reached a new apex. Annie's current state was well known. It always was. And it needed to be, by design. How else could they keep an eye on her? How else could she be used as an example? But Annie was worsening. One such monitor had noticed Annie glancing with head turned toward at least one of the other wet girls. Maybe even several. Admiring their nakedness."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/6f2fcee5-17f8-486e-bbc3-f9d889dc0688/width=525/6f2fcee5-17f8-486e-bbc3-f9d889dc0688.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 44
        }
      ]
    },
    "44": {
      "id": "44",
      "text_lines": [
        "It was obvious, in this monitor's mind, that Annie had had lustful thoughts, and that her eyes had focused, rested, and remained too long on these impressionable, susceptible bodies. The bodies and the honor of these well-behaved girls must be safeguarded."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/3ac059c7-9615-46d6-a747-cd983dee2040/width=525/3ac059c7-9615-46d6-a747-cd983dee2040.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 45
        }
      ]
    },
    "45": {
      "id": "45",
      "text_lines": [
        "The clipboard came out, as did the pen. Notes were furiously jotted. The monitor had noticed the flushing, reddening on the vulva and around the nipples indicative of the rush of blood, which Annie certainly graciously allowed into her genitalia."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/7c5d664a-3bca-41c1-b466-3a1d1f4a2351/width=525/7c5d664a-3bca-41c1-b466-3a1d1f4a2351.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 46
        }
      ]
    },
    "46": {
      "id": "46",
      "text_lines": [
        "That intense reddening gave Annie away. And Annie had given in to lust. It had to be noted and reported."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/5954a62c-3030-4e4c-b7ea-f05223b3c9a9/width=525/5954a62c-3030-4e4c-b7ea-f05223b3c9a9.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 47
        }
      ]
    },
    "47": {
      "id": "47",
      "text_lines": [
        "Soon after, Annie was assigned separate bathing times, apart from the other girls. And more than one monitor, ideally at least three, must be present. All of Annie's shaving, whether it be arms, legs, asshole, and pussy, all would no longer be allowed to be performed by Annie, nor done in private."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/1f987620-3217-4128-a76b-b43885616e4e/width=525/1f987620-3217-4128-a76b-b43885616e4e.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 48
        }
      ]
    },
    "48": {
      "id": "48",
      "text_lines": [
        "Razor privilege was removed. Razors dedicated for Annie would be dispensed daily to any staff necessary to keep her in compliance. Shaving would be done for her, and to her, in full view of monitors. Male monitors would be brought in, seeking their unique perspective, stringent requirements, and tough enforcement. Strangers' hands would be touching, fondling, pressing, grabbing, probing, pinching, rubbing--whatever needed to do be done, what Annie failed to manage herself."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/96b220a4-96e7-415a-b3db-4100c250f502/width=525/96b220a4-96e7-415a-b3db-4100c250f502.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 49
        }
      ]
    },
    "49": {
      "id": "49",
      "text_lines": [
        "Annie could no longer be trusted. While her pussy dripped, and standing fully raw, fully humiliated, and defenseless immediately in front of the headmistress, she was told as much. She was told that she was regressing. That she should be thankful the academy cares enough to not give up on her. She felt crushed. She failed yet again. Annie felt like a failure... and even more alone. And even more watched, and even more on display."
      ],
      "media": {
        "type": "image",
        "src": "https://image.civitai.com/xG1nkqKTMzGDvpLrqFT7WA/a2a4b77c-8819-40b1-9010-0ca9f233ad1a/width=525/a2a4b77c-8819-40b1-9010-0ca9f233ad1a.jpeg"
      },
      "next": [
        {
          "text": "",
          "next": 50
        }
      ]
    },
    "50": {
      "id": "50",
      "text_lines": [
        "It's going to be a waking nightmare for Annie...",
        "",
        "",
        "[See here for chapter 3](https://civitai.com/articles/10867/discipline-for-annie)"
      ]
    }
  }
}